[Killed] BlockStatement
src/main/pages/LoginPage.jsx:8:25
 import getBackgroundImage from "main/components/Utils/HomePageBackground";
 import { useSystemInfo } from "main/utils/systemInfo";
 
-const LoginCard = () => {
-  const { data: systemInfo } = useSystemInfo();
-  var oauthLogin = systemInfo.oauthLogin || "/oauth2/authorization/google";
-  return (
-    <Card
-      style={
-        // Stryker disable next-line all : no need to unit test CSS
-        { width: "18rem" }
-      }
-    >
-      <Card.Body>
-        <Card.Title data-testid="loginPage-cardTitle">
-          Welcome to Happy Cows!
-        </Card.Title>
-        <Card.Text>In order to start playing, please login.</Card.Text>
-        <Button href={oauthLogin} variant="primary">
-          Log In
-        </Button>
-      </Card.Body>
-    </Card>
-  );
-};
+const LoginCard = () => {};
 
 export default function LoginPage() {
killedBy: LoginPage tests renders without crashing when lists return empty list
statusReason: Unable to find an element by: [data-testid="loginPage-cardTitle"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="background-size: cover; background-image: url(/src/assets/HomePageBackground-day.jpg);"
    >

[Killed] ConditionalExpression
src/main/pages/LoginPage.jsx:10:20
 
 const LoginCard = () => {
   const { data: systemInfo } = useSystemInfo();
-  var oauthLogin = systemInfo.oauthLogin || "/oauth2/authorization/google";
+  var oauthLogin = true;
   return (
     <Card
killedBy: LoginPage tests when oauthlogin undefined, login card default value is used
statusReason: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null

[Killed] LogicalOperator
src/main/pages/LoginPage.jsx:10:20
 
 const LoginCard = () => {
   const { data: systemInfo } = useSystemInfo();
-  var oauthLogin = systemInfo.oauthLogin || "/oauth2/authorization/google";
+  var oauthLogin = systemInfo.oauthLogin && "/oauth2/authorization/google";
   return (
     <Card
killedBy: LoginPage tests when oauthlogin undefined, login card default value is used
statusReason: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null
