[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:82:13
 
   const objectToAxiosParamsUpdateCowHealthJob = () => ({
     url: `/api/jobs/launch/updatecowhealth`,
-    method: "POST",
+    method: "",
   });
 
killedBy: AdminJobsPage tests user can submit update cow health job for all commons
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.jsx:118:52
 
   // *** MilkTheCows job ***
 
-  const objectToAxiosParamsMilkTheCowsJob = () => ({
-    url: `/api/jobs/launch/milkthecowjob`,
-    method: "POST",
-  });
+  const objectToAxiosParamsMilkTheCowsJob = () => ({});
 
   const objectToAxiosParamsMilkTheCowsJobSingle = (data) => ({
killedBy: AdminJobsPage tests user can submit milk the cows job for all commons
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] EqualityOperator
src/main/pages/AdminJobsPage.jsx:143:9
   // Stryker restore all
 
   const submitMilkTheCowsJob = async (data) => {
-    if (data.selectedCommonsName === "All Commons") {
+    if (data.selectedCommonsName !== "All Commons") {
       toast("Submitted Job: Milk The Cows!");
       MilkTheCowsMutation.mutate();
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: expected '/api/jobs/launch/milkthecowjob' to be '/api/jobs/launch/milkthecowjobsinglec…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
