[Killed] BlockStatement
src/main/utils/currentUser.js:5:34
 import axios from "axios";
 import { useNavigate } from "react-router";
 
-export function useCurrentUser() {
-  let rolesList = ["ERROR_GETTING_ROLES"];
-  return useQuery(
-    "/api/currentUser",
-    async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        try {
-          rolesList = response.data.roles.map((r) => r.authority);
-        } catch (e) {
-          console.error("Error getting roles: ", e);
-        }
-        response.data = { ...response.data, rolesList: rolesList };
-        return { loggedIn: true, root: response.data };
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return { loggedIn: false, root: null };
-      }
-    },
-    {
-      initialData: () => ({ loggedIn: false, root: null })
-    },
-  );
-}
+export function useCurrentUser() {}
 
 export function useLogout() {
killedBy: PlayPage tests renders without crashing
statusReason: Cannot destructure property 'data' of '(0 , useCurrentUser)(...)' as it is undefined.

[Killed] BooleanLiteral
src/main/utils/currentUser.js:25:39
       }
     },
     {
-      initialData: () => ({ loggedIn: false, root: null })
+      initialData: () => ({ loggedIn: true, root: null })
     },
   );
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/main/utils/currentUser.js:25:20
       }
     },
     {
-      initialData: () => ({ loggedIn: false, root: null })
+      initialData: () => undefined
     },
   );
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Unable to find an element by: [data-testid="ChatDisplay"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
