[Killed] BlockStatement
src/main/components/OurTable.jsx:49:54
             const { key: hgKey, ...hgProps } = headerGroup.getHeaderGroupProps();
             return (
               <tr key={hgKey} {...hgProps}>
-                {headerGroup.headers.map((column) => {
-                  const headerProps = column.getHeaderProps(column.getSortByToggleProps());
-                  const { key: colKey, ...restHeaderProps } = headerProps;
-                  return (
-                    <th
-                      key={colKey}
-                      {...restHeaderProps}
-                      data-testid={`${testid}-header-${column.id}`}
-                    >
-                      {column.render("Header")}
-                      <span
-                        data-testid={`${testid}-header-${column.id}-sort-carets`}
-                      >
-                        {column.isSorted
-                          ? column.isSortedDesc
-                            ? " 🔽"
-                            : " 🔼"
-                          : ""}
-                      </span>
-                    </th>
-                  );
-                })}
+                {headerGroup.headers.map((column) => {})}
               </tr>
             );
killedBy: OurTable tests default testid is testId
statusReason: Unable to find an element by: [data-testid="testid-header-col1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
src/main/components/OurTable.jsx:66:29
                           ? column.isSortedDesc
                             ? " 🔽"
                             : " 🔼"
-                          : ""}
+                          : "Stryker was here!"}
                       </span>
                     </th>
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: expect(element).toHaveTextContent()

Checking with empty string will always match, use .toBeEmptyDOMElement() instead:

Received:
  Stryker was here!

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:118:14
                 {1}
               </Pagination.Item>
             )}
-            {pageIndex > 4 && (
-              <Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />
-            )}
+            {false}
             {pageIndex === 4 && (
               <Pagination.Item
killedBy: OurTable tests renders a table with 51 rows and tests the first and last page buttons
statusReason: Unable to find an element by: [data-testid="testid-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >
