[Killed] ObjectLiteral
main/components/Announcement/AnnouncementForm.jsx:57:37
           id="startDate"
           type="datetime-local"
           isInvalid={Boolean(errors.startDate)}
-          {...register("startDate", {
-            required: "StartDate is required.",
-            pattern: isodate_regex,
-          })}
+          {...register("startDate", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: AnnouncementForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Start Date is required and must be provided in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:63:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.startDate &&
-            "Start Date is required and must be provided in ISO format."}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: AnnouncementForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Start Date is required and must be provided in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
