[Killed] BlockStatement
main/components/Announcement/AnnouncementTable.jsx:15:34
 export default function AnnouncementTable({ announcements, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/announcements/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: AnnouncementTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/announcements/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:16:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/announcements/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: AnnouncementTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/announcements/edit/1' ]

Received: 

  1st spy call:

  [
-   "/announcements/edit/1",

[Killed] ArrayDeclaration
main/components/Announcement/AnnouncementTable.jsx:33:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      Header: "id",
-      accessor: "id", // accessor is the "key" in the data
-    },
-    {
-      Header: "Start Date ISO Format",
-      accessor: "startDate",
-    },
-    {
-      Header: "End Date ISO Format",
-      accessor: "endDate",
-    },
-    {
-      Header: "Announcement",
-      accessor: "announcementText",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:57:56
       ButtonColumn("Edit", "primary", editCallback, "AnnouncementTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "AnnouncementTable"),
+      ButtonColumn("Delete", "danger", deleteCallback, ""),
     );
   }
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="AnnouncementTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >
