[Killed] MethodExpression
main/components/Chat/ChatDisplay.jsx:43:26
 
   // Stryker restore all
 
-  const sortedMessages = messagesPage.content.sort((a, b) => b.id - a.id);
+  const sortedMessages = messagesPage.content;
 
   const userIdToUsername = userCommonsList.reduce((acc, user) => {
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: expected 'ChatMessageDisplay-2' to be 'ChatMessageDisplay-1' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/components/Chat/ChatDisplay.jsx:43:52
 
   // Stryker restore all
 
-  const sortedMessages = messagesPage.content.sort((a, b) => b.id - a.id);
+  const sortedMessages = messagesPage.content.sort(() => undefined);
 
   const userIdToUsername = userCommonsList.reduce((acc, user) => {
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: expected 'ChatMessageDisplay-2' to be 'ChatMessageDisplay-1' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:46:24
   const sortedMessages = messagesPage.content.sort((a, b) => b.id - a.id);
 
   const userIdToUsername = userCommonsList.reduce((acc, user) => {
-    acc[user.userId] = user.username || "";
+    acc[user.userId] = true;
     return acc;
   }, {});
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  George Washington
Received:

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:60:8
       }}
       data-testid="ChatDisplay"
     >
-      {Array.isArray(sortedMessages) &&
-        sortedMessages.slice(0, initialMessagePageSize).map((message) => (
-          <ChatMessageDisplay
-            key={message.id}
-            message={{
-              ...message,
-              username: userIdToUsername[message.userId],
-            }}
-          />
-        ))}
+      {false}
     </div>
   );
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Cannot read properties of undefined (reading 'getAttribute')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:60:8
       }}
       data-testid="ChatDisplay"
     >
-      {Array.isArray(sortedMessages) &&
-        sortedMessages.slice(0, initialMessagePageSize).map((message) => (
-          <ChatMessageDisplay
-            key={message.id}
-            message={{
-              ...message,
-              username: userIdToUsername[message.userId],
-            }}
-          />
-        ))}
+      {true}
     </div>
   );
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Cannot read properties of undefined (reading 'getAttribute')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] MethodExpression
main/components/Chat/ChatDisplay.jsx:61:9
       data-testid="ChatDisplay"
     >
       {Array.isArray(sortedMessages) &&
-        sortedMessages.slice(0, initialMessagePageSize).map((message) => (
+        sortedMessages.map((message) => (
           <ChatMessageDisplay
             key={message.id}
killedBy: ChatDisplay tests displays cuts off at 100 messages
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="card bg-secondary text-white"
  data-testid="ChatMessageDisplay-1"
>
  <div
    class="card-body"

[Killed] ArrowFunction
main/components/Chat/ChatDisplay.jsx:61:61
       data-testid="ChatDisplay"
     >
       {Array.isArray(sortedMessages) &&
-        sortedMessages.slice(0, initialMessagePageSize).map((message) => (
-          <ChatMessageDisplay
-            key={message.id}
-            message={{
-              ...message,
-              username: userIdToUsername[message.userId],
-            }}
-          />
-        ))}
+        sortedMessages.slice(0, initialMessagePageSize).map(() => undefined)}
     </div>
   );
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Cannot read properties of undefined (reading 'getAttribute')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
