[Killed] StringLiteral
main/components/Chat/ChatMessageCreate.jsx:8:18
 import { useBackendMutation } from "main/utils/useBackend";
 
 const ChatMessageCreate = ({ commonsId, submitAction }) => {
-  const testid = "ChatMessageCreate";
+  const testid = "";
   const initialMessagePageSize = 10;
 
killedBy: ChatMessageCreate renders without crashing
statusReason: Unable to find an element by: [data-testid="ChatMessageCreate-Message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      data-testid=""

[Killed] ArrowFunction
main/components/Chat/ChatMessageCreate.jsx:11:31
   const testid = "ChatMessageCreate";
   const initialMessagePageSize = 10;
 
-  const objectToAxiosParams = (newMessage) => ({
-    // Stryker disable next-line all : axiosMock post test works when mutated
-    url: `/api/chat/post?commonsId=${newMessage.commonsId}&content=${newMessage.content}`,
-    method: "POST",
-    data: newMessage,
-  });
+  const objectToAxiosParams = () => undefined;
 
   const mutation = useBackendMutation(
killedBy: ChatMessageCreate When you fill in the message form and click submit, the right things happen
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] StringLiteral
main/components/Chat/ChatMessageCreate.jsx:14:13
   const objectToAxiosParams = (newMessage) => ({
     // Stryker disable next-line all : axiosMock post test works when mutated
     url: `/api/chat/post?commonsId=${newMessage.commonsId}&content=${newMessage.content}`,
-    method: "POST",
+    method: "",
     data: newMessage,
   });
killedBy: ChatMessageCreate When you fill in the message form and click submit, the right things happen
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form
