[Killed] BlockStatement
main/components/Commons/CommonsCard.jsx:6:37
 
 const curr = new Date();
 
-function isFutureDate(startingDate) {
-  const startYear = parseInt(startingDate);
-  const startMonth = parseInt(startingDate.substring(5, 7));
-  const startDate = parseInt(startingDate.substring(8, 10));
-  const currYear = curr.getFullYear();
-  const currMonth = curr.getMonth() + 1;
-  const currDate = curr.getDate();
-
-  if (startYear === currYear) {
-    if (startMonth === currMonth) {
-      return startDate > currDate;
-    } else {
-      // Stryker disable next-line all: mutation test unreasonable
-      return startMonth > currMonth;
-    }
-  } else {
-    // Stryker disable next-line all: mutation test unreasonable
-    return startYear > currYear;
-  }
-}
+function isFutureDate(startingDate) {}
 
 const CommonsCard = ({ buttonText, buttonLink, commons }) => {
killedBy: CommonsCard tests cannot join commons with future start date - future year
statusReason: expected "spy" to be called +0 times, but got 1 times

[Killed] MethodExpression
main/components/Commons/CommonsCard.jsx:8:31
 
 function isFutureDate(startingDate) {
   const startYear = parseInt(startingDate);
-  const startMonth = parseInt(startingDate.substring(5, 7));
+  const startMonth = parseInt(startingDate);
   const startDate = parseInt(startingDate.substring(8, 10));
   const currYear = curr.getFullYear();
killedBy: CommonsCard tests can join commons with past date - past month
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] MethodExpression
main/components/Commons/CommonsCard.jsx:9:30
 function isFutureDate(startingDate) {
   const startYear = parseInt(startingDate);
   const startMonth = parseInt(startingDate.substring(5, 7));
-  const startDate = parseInt(startingDate.substring(8, 10));
+  const startDate = parseInt(startingDate);
   const currYear = curr.getFullYear();
   const currMonth = curr.getMonth() + 1;
killedBy: CommonsCard tests can join commons with current date
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ArithmeticOperator
main/components/Commons/CommonsCard.jsx:11:21
   const startMonth = parseInt(startingDate.substring(5, 7));
   const startDate = parseInt(startingDate.substring(8, 10));
   const currYear = curr.getFullYear();
-  const currMonth = curr.getMonth() + 1;
+  const currMonth = curr.getMonth() - 1;
   const currDate = curr.getDate();
 
killedBy: CommonsCard tests can join commons with past date - past month
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
main/components/Commons/CommonsCard.jsx:14:7
   const currMonth = curr.getMonth() + 1;
   const currDate = curr.getDate();
 
-  if (startYear === currYear) {
+  if (false) {
     if (startMonth === currMonth) {
       return startDate > currDate;
killedBy: CommonsCard tests cannot join commons with future start date - future day
statusReason: expected "spy" to be called +0 times, but got 1 times

[Killed] BlockStatement
main/components/Commons/CommonsCard.jsx:14:31
   const currMonth = curr.getMonth() + 1;
   const currDate = curr.getDate();
 
-  if (startYear === currYear) {
-    if (startMonth === currMonth) {
-      return startDate > currDate;
-    } else {
-      // Stryker disable next-line all: mutation test unreasonable
-      return startMonth > currMonth;
-    }
-  } else {
+  if (startYear === currYear) {} else {
     // Stryker disable next-line all: mutation test unreasonable
     return startYear > currYear;
killedBy: CommonsCard tests cannot join commons with future start date - future day
statusReason: expected "spy" to be called +0 times, but got 1 times

[Killed] BlockStatement
main/components/Commons/CommonsCard.jsx:15:35
   const currDate = curr.getDate();
 
   if (startYear === currYear) {
-    if (startMonth === currMonth) {
-      return startDate > currDate;
-    } else {
+    if (startMonth === currMonth) {} else {
       // Stryker disable next-line all: mutation test unreasonable
       return startMonth > currMonth;
killedBy: CommonsCard tests cannot join commons with future start date - future day
statusReason: expected "spy" to be called +0 times, but got 1 times

[Killed] EqualityOperator
main/components/Commons/CommonsCard.jsx:15:9
   const currDate = curr.getDate();
 
   if (startYear === currYear) {
-    if (startMonth === currMonth) {
+    if (startMonth !== currMonth) {
       return startDate > currDate;
     } else {
killedBy: CommonsCard tests cannot join commons with future start date - future day
statusReason: expected "spy" to be called +0 times, but got 1 times

[Killed] EqualityOperator
main/components/Commons/CommonsCard.jsx:16:14
 
   if (startYear === currYear) {
     if (startMonth === currMonth) {
-      return startDate > currDate;
+      return startDate <= currDate;
     } else {
       // Stryker disable next-line all: mutation test unreasonable
killedBy: CommonsCard tests cannot join commons with future start date - future day
statusReason: expected "spy" to be called +0 times, but got 1 times

[Killed] ConditionalExpression
main/components/Commons/CommonsCard.jsx:16:14
 
   if (startYear === currYear) {
     if (startMonth === currMonth) {
-      return startDate > currDate;
+      return true;
     } else {
       // Stryker disable next-line all: mutation test unreasonable
killedBy: CommonsCard tests can join commons with current date
statusReason: expected "spy" to be called 1 times, but got 0 times

[Survived] BlockStatement
main/components/Commons/CommonsCard.jsx:17:12
   if (startYear === currYear) {
     if (startMonth === currMonth) {
       return startDate > currDate;
-    } else {
-      // Stryker disable next-line all: mutation test unreasonable
-      return startMonth > currMonth;
-    }
+    } else {}
   } else {
     // Stryker disable next-line all: mutation test unreasonable

[Killed] BlockStatement
main/components/Commons/CommonsCard.jsx:21:10
       // Stryker disable next-line all: mutation test unreasonable
       return startMonth > currMonth;
     }
-  } else {
-    // Stryker disable next-line all: mutation test unreasonable
-    return startYear > currYear;
-  }
+  } else {}
 }
 
killedBy: CommonsCard tests cannot join commons with future start date - future year
statusReason: expected "spy" to be called +0 times, but got 1 times

[Killed] StringLiteral
main/components/Commons/CommonsCard.jsx:28:24
 }
 
 const CommonsCard = ({ buttonText, buttonLink, commons }) => {
-  const testIdPrefix = "commonsCard";
+  const testIdPrefix = "";
   return (
     <Card.Body className="woodenboardtable">
killedBy: CommonsCard tests renders without crashing when button text is set
statusReason: Unable to find an element by: [data-testid="commonsCard-button-Join-5"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="woodenboardtable card-body"
    >

[Killed] StringLiteral
main/components/Commons/CommonsCard.jsx:33:36
     <Card.Body className="woodenboardtable">
       <Container>
         <Row>
-          <Col sx={4} data-testid={`${testIdPrefix}-id-${commons.id}`}>
+          <Col sx={4} data-testid={``}>
             {commons.id}
           </Col>
killedBy: CommonsCard tests renders without crashing when button text is set
statusReason: Unable to find an element by: [data-testid="commonsCard-id-5"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="woodenboardtable card-body"
    >

[Killed] ConditionalExpression
main/components/Commons/CommonsCard.jsx:47:21
                 className="buttonchange"
                 onClick={() => {
                   if (
-                    buttonText === "Join" &&
-                    isFutureDate(commons.startingDate)
+                    true
                   ) {
                     // Stryker disable all: unable to read alert text in tests
killedBy: CommonsCard tests renders without crashing when button text is set
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
main/components/Commons/CommonsCard.jsx:47:21
                 className="buttonchange"
                 onClick={() => {
                   if (
-                    buttonText === "Join" &&
+                    true &&
                     isFutureDate(commons.startingDate)
                   ) {
killedBy: CommonsCard tests can visit even if wrong future date
statusReason: expected "spy" to be called 1 times, but got 0 times
