[Killed] StringLiteral
main/components/Commons/CommonsForm.jsx:78:18
   }, [defaultValuesData, initialCommons, reset]);
   // Stryker restore all
 
-  const testid = "CommonsForm";
+  const testid = "";
   const curr = new Date();
   const today = curr.toLocaleDateString("en-CA"); // Canadian english gives YYYY-MM-DD
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Unable to find an element by: [data-testid="CommonsForm-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Commons/CommonsForm.jsx:80:41
 
   const testid = "CommonsForm";
   const curr = new Date();
-  const today = curr.toLocaleDateString("en-CA"); // Canadian english gives YYYY-MM-DD
+  const today = curr.toLocaleDateString(""); // Canadian english gives YYYY-MM-DD
   const currMonth = curr.getMonth() % 12;
   const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate())
killedBy: CommonsForm tests renders correctly
statusReason: Incorrect locale information provided

[Killed] ArithmeticOperator
main/components/Commons/CommonsForm.jsx:81:21
   const testid = "CommonsForm";
   const curr = new Date();
   const today = curr.toLocaleDateString("en-CA"); // Canadian english gives YYYY-MM-DD
-  const currMonth = curr.getMonth() % 12;
+  const currMonth = curr.getMonth() * 12;
   const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate())
     .toISOString()
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: expect(element).toHaveValue(2025-12-06)

Expected the element to have value:
  2025-12-06
Received:
  2035-02-06

[Killed] ArithmeticOperator
main/components/Commons/CommonsForm.jsx:82:50
   const curr = new Date();
   const today = curr.toLocaleDateString("en-CA"); // Canadian english gives YYYY-MM-DD
   const currMonth = curr.getMonth() % 12;
-  const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate())
+  const nextMonth = new Date(curr.getFullYear(), currMonth - 1, curr.getDate())
     .toISOString()
     .substr(0, 10);
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: expect(element).toHaveValue(2025-12-06)

Expected the element to have value:
  2025-12-06
Received:
  2025-10-06

[Killed] MethodExpression
main/components/Commons/CommonsForm.jsx:82:21
   const curr = new Date();
   const today = curr.toLocaleDateString("en-CA"); // Canadian english gives YYYY-MM-DD
   const currMonth = curr.getMonth() % 12;
-  const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate())
-    .toISOString()
-    .substr(0, 10);
+  const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate()).toISOString();
   const DefaultVals = {
     name: "",
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: expect(element).toHaveValue(2025-12-06)

Expected the element to have value:
  2025-12-06
Received:

[Killed] LogicalOperator
main/components/Commons/CommonsForm.jsx:88:15
   const DefaultVals = {
     name: "",
     startingBalance: defaultValuesData?.startingBalance || "10000",
-    cowPrice: defaultValuesData?.cowPrice || "100",
+    cowPrice: defaultValuesData?.cowPrice && "100",
     milkPrice: defaultValuesData?.milkPrice || "1",
     degradationRate: defaultValuesData?.degradationRate || 0.001,
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  null

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.jsx:89:16
     name: "",
     startingBalance: defaultValuesData?.startingBalance || "10000",
     cowPrice: defaultValuesData?.cowPrice || "100",
-    milkPrice: defaultValuesData?.milkPrice || "1",
+    milkPrice: true,
     degradationRate: defaultValuesData?.degradationRate || 0.001,
     carryingCapacity: defaultValuesData?.carryingCapacity || 100,
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:
  null

[Killed] OptionalChaining
main/components/Commons/CommonsForm.jsx:91:23
     cowPrice: defaultValuesData?.cowPrice || "100",
     milkPrice: defaultValuesData?.milkPrice || "1",
     degradationRate: defaultValuesData?.degradationRate || 0.001,
-    carryingCapacity: defaultValuesData?.carryingCapacity || 100,
+    carryingCapacity: defaultValuesData.carryingCapacity || 100,
     startingDate: today,
     lastDate: nextMonth,
killedBy: CommonsForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'carryingCapacity')

[Killed] StringLiteral
main/components/Commons/CommonsForm.jsx:105:26
         <Form.Group className="mb-3">
           <Form.Label htmlFor="id">Id</Form.Label>
           <Form.Control
-            data-testid={`${testid}-id`}
+            data-testid={``}
             id="id"
             type="text"
killedBy: CommonsForm tests renders correctly when an initialCommons is passed in
statusReason: Unable to find an element by: [data-testid="CommonsForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Commons/CommonsForm.jsx:119:25
 
       <Row
         className="flex justify-content-start"
-        style={{ width: "80%" }}
+        style={{ width: "" }}
         data-testid={`${testid}-r0`}
       >
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- width: 80%;

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.jsx:167:49
                 step="0.01"
                 defaultValue={DefaultVals.startingBalance}
                 isInvalid={!!errors.startingBalance}
-                {...register("startingBalance", {
-                  valueAsNumber: true,
-                  required: "Starting Balance is required",
-                  min: {
-                    value: 0.0,
-                    message: "Starting Balance must be ≥ 0.00",
-                  },
-                })}
+                {...register("startingBalance", {})}
               />
             </OverlayTrigger>
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Unable to find an element with the text: Starting Balance is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.jsx:186:16
 
       <Row
         className="flex justify-content-start"
-        style={{ width: "80%" }}
+        style={{}}
         data-testid={`${testid}-r1`}
       >
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- width: 80%;

[Killed] StringLiteral
main/components/Commons/CommonsForm.jsx:245:30
                 step="0.01"
                 defaultValue={DefaultVals.milkPrice}
                 isInvalid={!!errors.milkPrice}
-                {...register("milkPrice", {
+                {...register("", {
                   valueAsNumber: true,
                   required: "Milk price is required",
killedBy: CommonsForm tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Commons/CommonsForm.jsx:261:25
 
       <Row
         className="mt-1 flex justify-content-start"
-        style={{ width: "80%" }}
+        style={{ width: "" }}
         data-testid={`${testid}-r2`}
       >
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- width: 80%;

[Killed] StringLiteral
main/components/Commons/CommonsForm.jsx:262:22
       <Row
         className="mt-1 flex justify-content-start"
         style={{ width: "80%" }}
-        data-testid={`${testid}-r2`}
+        data-testid={``}
       >
         <Col md={4}>
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Unable to find an element by: [data-testid="CommonsForm-r2"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Commons/CommonsForm.jsx:280:30
               delay="100"
             >
               <Form.Control
-                data-testid={`${testid}-degradationRate`}
+                data-testid={``}
                 id="degradationRate"
                 type="number"
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.jsx:285:29
                 type="number"
                 step="0.0001"
                 defaultValue={DefaultVals.degradationRate}
-                isInvalid={!!errors.degradationRate}
+                isInvalid={!errors.degradationRate}
                 {...register("degradationRate", {
                   valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] StringLiteral
main/components/Commons/CommonsForm.jsx:378:44
       <Row>
         <Form.Group
           className="mb-5"
-          style={{ width: "300px", height: "50px" }}
+          style={{ width: "300px", height: "" }}
           data-testid={`${testid}-r3`}
         >
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Commons/CommonsForm.jsx:379:24
         <Form.Group
           className="mb-5"
           style={{ width: "300px", height: "50px" }}
-          data-testid={`${testid}-r3`}
+          data-testid={``}
         >
           <Form.Label htmlFor="startingDate">Starting Date</Form.Label>
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Commons/CommonsForm.jsx:426:23
       <Row>
         <Col md={6}>
           <HealthUpdateStrategiesDropdown
-            formName={"aboveCapacityHealthUpdateStrategy"}
+            formName={""}
             displayName={"When above capacity"}
             initialValue={aboveStrategy}
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Commons/CommonsForm.jsx:484:30
               delay="100"
             >
               <Form.Check
-                data-testid={`${testid}-showChat`}
+                data-testid={``}
                 type="checkbox"
                 id="showChat"
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Unable to find an element by: [data-testid="CommonsForm-showChat"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
