[Killed] OptionalChaining
main/components/Commons/CommonsList.jsx:6:26
 import { Card, Container, Row, Col } from "react-bootstrap";
 
 const CommonsList = (props) => {
-  const defaultMessage = props.title?.includes("Join") ? "join" : "visit";
+  const defaultMessage = props.title.includes("Join") ? "join" : "visit";
 
   return (
killedBy: CommonsList tests renders no button when button text is null
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] StringLiteral
main/components/Commons/CommonsList.jsx:6:48
 import { Card, Container, Row, Col } from "react-bootstrap";
 
 const CommonsList = (props) => {
-  const defaultMessage = props.title?.includes("Join") ? "join" : "visit";
+  const defaultMessage = props.title?.includes("") ? "join" : "visit";
 
   return (
killedBy: CommonsList tests renders default visit UI when there are no commons
statusReason: expected 'There are currently no commons to join' to deeply equal 'There are currently no commons to vis…'

[Killed] EqualityOperator
main/components/Commons/CommonsList.jsx:38:8
       >
         {props.title}
       </Card.Title>
-      {props.commonList.length > 0 ? (
+      {props.commonList.length >= 0 ? (
         <React.Fragment>
           <Card.Subtitle>
killedBy: CommonsList tests renders default join UI when there are no commons
statusReason: Unable to find an element by: [data-testid="commonsList-default-message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="my-3 card"
      style="opacity: 1; background-color: rgb(147, 98, 66); color: rgb(245, 210, 140); border: 6px solid rgb(99,71,52);"

[Killed] ConditionalExpression
main/components/Commons/CommonsList.jsx:38:8
       >
         {props.title}
       </Card.Title>
-      {props.commonList.length > 0 ? (
+      {true ? (
         <React.Fragment>
           <Card.Subtitle>
killedBy: CommonsList tests renders default join UI when there are no commons
statusReason: Unable to find an element by: [data-testid="commonsList-default-message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="my-3 card"
      style="opacity: 1; background-color: rgb(147, 98, 66); color: rgb(245, 210, 140); border: 6px solid rgb(99,71,52);"

[Killed] ArrowFunction
main/components/Commons/CommonsList.jsx:67:33
               </Row>
             </Container>
           </Card.Subtitle>
-          {props.commonList.map((c) => (
-            <CommonsCard
-              key={c.id}
-              commons={c}
-              buttonText={props.buttonText}
-              buttonLink={props.buttonLink}
-            />
-          ))}
+          {props.commonList.map(() => undefined)}
         </React.Fragment>
       ) : (
killedBy: CommonsList tests renders without crashing when button text is set
statusReason: Unable to find an element by: [data-testid="/commonsCard-button/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="my-3 card"
      style="opacity: 1; background-color: rgb(147, 98, 66); color: rgb(245, 210, 140); border: 6px solid rgb(99,71,52);"
