[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.jsx:15:5
   };
   // Stryker restore all
   const showLeaderboard =
-    hasRole(currentUser, "ROLE_ADMIN") || commonsPlus.commons.showLeaderboard;
+    true;
   return (
     <Card data-testid="CommonsOverview">
killedBy: CommonsOverview tests No LeaderboardPage for an ordinary user when commons has showLeaderboard = false
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-outline-success"
  data-testid="user-leaderboard-button"
  type="button"
>
  Leaderboard

[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.jsx:15:5
   };
   // Stryker restore all
   const showLeaderboard =
-    hasRole(currentUser, "ROLE_ADMIN") || commonsPlus.commons.showLeaderboard;
+    false;
   return (
     <Card data-testid="CommonsOverview">
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: Unable to find an element by: [data-testid="user-leaderboard-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.jsx:36:14
             <Card.Text>Total Players: {commonsPlus.totalUsers}</Card.Text>
           </Col>
           <Col>
-            {showLeaderboard && (
-              <Button
-                variant="outline-success"
-                data-testid="user-leaderboard-button"
-                onClick={leaderboardButtonClick}
-              >
-                Leaderboard
-              </Button>
-            )}
+            {false}
           </Col>
         </Row>
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: Unable to find an element by: [data-testid="user-leaderboard-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] LogicalOperator
main/components/Commons/CommonsOverview.jsx:36:14
             <Card.Text>Total Players: {commonsPlus.totalUsers}</Card.Text>
           </Col>
           <Col>
-            {showLeaderboard && (
-              <Button
-                variant="outline-success"
-                data-testid="user-leaderboard-button"
-                onClick={leaderboardButtonClick}
-              >
-                Leaderboard
-              </Button>
-            )}
+            {showLeaderboard || <Button variant="outline-success" data-testid="user-leaderboard-button" onClick={leaderboardButtonClick}>
+                Leaderboard
+              </Button>}
           </Col>
         </Row>
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: Unable to find an element by: [data-testid="user-leaderboard-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"
