[Killed] BlockStatement
main/components/Commons/CommonsPlay.jsx:5:54
 import greetingsList from "../../../assets/PlayGreetings.json";
 import "../../pages/HomePage.css";
 import { Card } from "react-bootstrap";
-export default function CommonsPlay({ currentUser }) {
-  // Stryker disable  all
-  const firstName = currentUser?.root ? currentUser?.root?.user?.givenName : "";
-
-  const [welcomeText, _] = useState(
-    greetingsList[Math.floor(Math.random() * greetingsList.length)],
-  );
-  // Stryker restore all
-
-  return (
-    <div data-testid="CommonsPlay">
-      <Card data-testid="commons-card" className="woodentitle">
-        <div className="text-center border-0 my-3">
-          <h1 data-testid="commonsPlay-title" className="animate-charcter">
-            {welcomeText} {firstName}!
-          </h1>
-        </div>
-      </Card>
-    </div>
-  );
-}
+export default function CommonsPlay({ currentUser }) {}
 
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Unable to find an element by: [data-testid="CommonsPlay"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
