[Killed] OptionalChaining
main/components/Commons/ManageCows.jsx:29:34
       >
         {/* change $10 to info from fixture */}
         <Card.Title className="text-center">
-          💵 Market Cow Price: ${commons?.cowPrice}
+          💵 Market Cow Price: ${ccommons.cowPrice
         </Card.Title>
         <Card.Title className="text-center">
killedBy: ManageCows tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'cowPrice')

[Killed] OptionalChaining
main/components/Commons/ManageCows.jsx:35:36
           🐮 Number of Cows: {userCommons.numOfCows}
         </Card.Title>
         <Card.Title className="text-center">
-          🥛 Current Milk Price: ${commons?.milkPrice}
+          🥛 Current Milk Price: ${ccommons.milkPrice
         </Card.Title>
         {/* when the ID doesnt match, dont show the buy/sell button */}
killedBy: ManageCows tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'milkPrice')

[Killed] BlockStatement
main/components/Commons/ManageCows.jsx:50:34
               <Col className="text-center">
                 <Button
                   variant="outline-success"
-                  onClick={() => {
-                    setMessage("buy");
-                    openModal();
-                  }}
+                  onClick={() => {}}
                   data-testid={"buy-cow-button"}
                 >
killedBy: PlayPage tests click buy button
statusReason: Unable to find an element by: [data-testid="buy-sell-cow-modal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] StringLiteral
main/components/Commons/ManageCows.jsx:54:32
                     setMessage("buy");
                     openModal();
                   }}
-                  data-testid={"buy-cow-button"}
+                  data-testid={""}
                 >
                   Buy cows
killedBy: PlayPage tests click buy button
statusReason: Unable to find an element by: [data-testid="buy-cow-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] BlockStatement
main/components/Commons/ManageCows.jsx:62:34
               <Col className="text-center">
                 <Button
                   variant="outline-danger"
-                  onClick={() => {
-                    setMessage("sell");
-                    openModal();
-                  }}
+                  onClick={() => {}}
                   data-testid={"sell-cow-button"}
                 >
killedBy: PlayPage tests click sell button
statusReason: Unable to find an element by: [data-testid="buy-sell-cow-modal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"
