[Killed] StringLiteral
main/components/Commons/PagedProfitsTable.jsx:34:18
   );
   // Stryker restore  all
 
-  const testid = "PagedProfitsTable";
+  const testid = "";
 
   const previousPageCallback = () => {
killedBy: PagedProfitsTable tests renders correct content
statusReason: Unable to find an element by: [data-testid="PagedProfitsTable-cell-row-0-col-amount"]

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Page: 
      1

[Killed] BlockStatement
main/components/Commons/PagedProfitsTable.jsx:36:38
 
   const testid = "PagedProfitsTable";
 
-  const previousPageCallback = () => {
-    return () => {
-      setSelectedPage(selectedPage - 1);
-    };
-  };
+  const previousPageCallback = () => {};
 
   const nextPageCallback = () => {
killedBy: PagedProfitsTable tests renders correct content with multiple pages
statusReason: Unable to find an element with the text: Page: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Page: 
      2

[Killed] BlockStatement
main/components/Commons/PagedProfitsTable.jsx:37:18
   const testid = "PagedProfitsTable";
 
   const previousPageCallback = () => {
-    return () => {
-      setSelectedPage(selectedPage - 1);
-    };
+    return () => {};
   };
 
killedBy: PagedProfitsTable tests renders correct content with multiple pages
statusReason: Unable to find an element with the text: Page: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Page: 
      2

[Killed] BlockStatement
main/components/Commons/PagedProfitsTable.jsx:42:34
     };
   };
 
-  const nextPageCallback = () => {
-    return () => {
-      setSelectedPage(selectedPage + 1);
-    };
-  };
+  const nextPageCallback = () => {};
 
   const columns = [
killedBy: PagedProfitsTable tests renders correct content with multiple pages
statusReason: Unable to find an element with the text: Page: 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Page: 
      1

[Killed] BlockStatement
main/components/Commons/PagedProfitsTable.jsx:43:18
   };
 
   const nextPageCallback = () => {
-    return () => {
-      setSelectedPage(selectedPage + 1);
-    };
+    return () => {};
   };
 
killedBy: PagedProfitsTable tests renders correct content with multiple pages
statusReason: Unable to find an element with the text: Page: 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Page: 
      1

[Killed] ArrayDeclaration
main/components/Commons/PagedProfitsTable.jsx:48:19
     };
   };
 
-  const columns = [
-    {
-      Header: "Profit",
-      accessor: "amount",
-      Cell: ({ value }) => `$${value.toFixed(2)}`,
-      width: 200,
-    },
-    {
-      Header: "Date",
-      accessor: "timestamp",
-      Cell: ({ value }) => timestampToDate(value),
-      width: 200,
-    },
-    {
-      Header: "Health",
-      accessor: "avgCowHealth",
-      Cell: ({ value }) => `${value.toFixed(2) + "%"}`,
-      width: 200,
-    },
-    {
-      Header: "Cows",
-      accessor: "numCows",
-      width: 200,
-    },
-  ];
+  const columns = [];
 
   const sortees = React.useMemo(
killedBy: PagedProfitsTable tests renders correct content
statusReason: Unable to find an element with the text: Profit. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Page: 
      1

[Killed] StringLiteral
main/components/Commons/PagedProfitsTable.jsx:51:17
   const columns = [
     {
       Header: "Profit",
-      accessor: "amount",
+      accessor: "",
       Cell: ({ value }) => `$${value.toFixed(2)}`,
       width: 200,
killedBy: PagedProfitsTable tests renders correct content
statusReason: Unable to find an element by: [data-testid="PagedProfitsTable-cell-row-0-col-amount"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.jsx:52:13
     {
       Header: "Profit",
       accessor: "amount",
-      Cell: ({ value }) => `$${value.toFixed(2)}`,
+      Cell: () => undefined,
       width: 200,
     },
killedBy: PagedProfitsTable tests renders correct content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  110
Received:

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.jsx:58:13
     {
       Header: "Date",
       accessor: "timestamp",
-      Cell: ({ value }) => timestampToDate(value),
+      Cell: () => undefined,
       width: 200,
     },
killedBy: PagedProfitsTable tests renders correct content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2024-06-16
Received:

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.jsx:64:13
     {
       Header: "Health",
       accessor: "avgCowHealth",
-      Cell: ({ value }) => `${value.toFixed(2) + "%"}`,
+      Cell: () => undefined,
       width: 200,
     },
killedBy: PagedProfitsTable tests renders correct content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100.00%
Received:

[Killed] ObjectLiteral
main/components/Commons/PagedProfitsTable.jsx:67:5
       Cell: ({ value }) => `${value.toFixed(2) + "%"}`,
       width: 200,
     },
-    {
-      Header: "Cows",
-      accessor: "numCows",
-      width: 200,
-    },
+    {},
   ];
 
killedBy: PagedProfitsTable tests renders correct content
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/PagedProfitsTable.jsx:69:17
     },
     {
       Header: "Cows",
-      accessor: "numCows",
+      accessor: "",
       width: 200,
     },
killedBy: PagedProfitsTable tests renders correct content
statusReason: Unable to find an element by: [data-testid="PagedProfitsTable-cell-row-0-col-numCows"]

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Page: 
      1

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.jsx:75:5
   ];
 
   const sortees = React.useMemo(
-    () => [
-      {
-        id: "timestamp",
-        desc: true,
-      },
-    ],
+    () => undefined,
     // Stryker disable next-line all
     [],
killedBy: PagedProfitsTable tests renders correct content
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] BooleanLiteral
main/components/Commons/PagedProfitsTable.jsx:78:15
     () => [
       {
         id: "timestamp",
-        desc: true,
+        desc: false,
       },
     ],
killedBy: PagedProfitsTable tests renders correct content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:
  🔼

[Killed] EqualityOperator
main/components/Commons/PagedProfitsTable.jsx:91:19
       <Button
         data-testid={`${testId}-previous-button`}
         onClick={previousPageCallback()}
-        disabled={selectedPage === 0}
+        disabled={selectedPage !== 0}
       >
         Previous
killedBy: PagedProfitsTable tests renders correct content
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  data-testid="PagedProfitsTable-previous-button"
  type="button"
/>

[Killed] ConditionalExpression
main/components/Commons/PagedProfitsTable.jsx:91:19
       <Button
         data-testid={`${testId}-previous-button`}
         onClick={previousPageCallback()}
-        disabled={selectedPage === 0}
+        disabled={false}
       >
         Previous
killedBy: PagedProfitsTable tests renders correct content
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  data-testid="PagedProfitsTable-previous-button"
  type="button"
/>

[Killed] EqualityOperator
main/components/Commons/PagedProfitsTable.jsx:98:44
       <Button
         data-testid={`${testId}-next-button`}
         onClick={nextPageCallback()}
-        disabled={page.totalPages === 0 || selectedPage === page.totalPages - 1}
+        disabled={page.totalPages === 0 || selectedPage !== page.totalPages - 1}
       >
         Next
killedBy: PagedProfitsTable tests renders correct content
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  data-testid="PagedProfitsTable-next-button"
  type="button"
/>

[Killed] ConditionalExpression
main/components/Commons/PagedProfitsTable.jsx:98:19
       <Button
         data-testid={`${testId}-next-button`}
         onClick={nextPageCallback()}
-        disabled={page.totalPages === 0 || selectedPage === page.totalPages - 1}
+        disabled={false}
       >
         Next
killedBy: PagedProfitsTable tests renders correct content
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  data-testid="PagedProfitsTable-next-button"
  type="button"
/>

[Killed] StringLiteral
main/components/Commons/PagedProfitsTable.jsx:106:21
         data-testid="PagedProfitsTable-CSS"
         style={{
           display: "flex",
-          overflow: "auto",
+          overflow: "",
         }}
       >
killedBy: PagedProfitsTable tests renders correct content
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

  display: flex;
- overflow: auto;
