[Killed] ArrowFunction
main/components/Commons/ProfitsTable.jsx:7:5
 export default function ProfitsTable({ profits }) {
   // Stryker disable ArrayDeclaration : [columns] and [students] are performance optimization; mutation preserves correctness
   const memoizedColumns = React.useMemo(
-    () => [
-      {
-        Header: "Profit",
-        accessor: (row) => `$${row.amount.toFixed(2)}`,
-      },
-      {
-        Header: "Date",
-        accessor: "timestamp",
-      },
-      {
-        Header: "Health",
-        accessor: (row) => `${row.avgCowHealth + "%"}`,
-      },
-      {
-        Header: "Cows",
-        accessor: "numCows",
-      },
-    ],
+    () => undefined,
     [],
   );
killedBy: ProfitsTable tests renders without crashing for 0 profits
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ObjectLiteral
main/components/Commons/ProfitsTable.jsx:8:7
   // Stryker disable ArrayDeclaration : [columns] and [students] are performance optimization; mutation preserves correctness
   const memoizedColumns = React.useMemo(
     () => [
-      {
-        Header: "Profit",
-        accessor: (row) => `$${row.amount.toFixed(2)}`,
-      },
+      {},
       {
         Header: "Date",
killedBy: ProfitsTable tests renders without crashing for 0 profits
statusReason: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Commons/ProfitsTable.jsx:12:7
         Header: "Profit",
         accessor: (row) => `$${row.amount.toFixed(2)}`,
       },
-      {
-        Header: "Date",
-        accessor: "timestamp",
-      },
+      {},
       {
         Header: "Health",
killedBy: ProfitsTable tests renders without crashing for 0 profits
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/ProfitsTable.jsx:14:19
       },
       {
         Header: "Date",
-        accessor: "timestamp",
+        accessor: "",
       },
       {
killedBy: ProfitsTable tests renders without crashing
statusReason: Unable to find an element with the text: 2023-05-15T20:50:00.043225. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ObjectLiteral
main/components/Commons/ProfitsTable.jsx:16:7
         Header: "Date",
         accessor: "timestamp",
       },
-      {
-        Header: "Health",
-        accessor: (row) => `${row.avgCowHealth + "%"}`,
-      },
+      {},
       {
         Header: "Cows",
killedBy: ProfitsTable tests renders without crashing for 0 profits
statusReason: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/ProfitsTable.jsx:18:19
       },
       {
         Header: "Health",
-        accessor: (row) => `${row.avgCowHealth + "%"}`,
+        accessor: () => undefined,
       },
       {
killedBy: ProfitsTable tests renders without crashing
statusReason: Unable to find an element with the text: 97%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ObjectLiteral
main/components/Commons/ProfitsTable.jsx:20:7
         Header: "Health",
         accessor: (row) => `${row.avgCowHealth + "%"}`,
       },
-      {
-        Header: "Cows",
-        accessor: "numCows",
-      },
+      {},
     ],
     [],
killedBy: ProfitsTable tests renders without crashing for 0 profits
statusReason: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/ProfitsTable.jsx:27:39
     ],
     [],
   );
-  const memoizedDates = React.useMemo(() => profits, [profits]);
+  const memoizedDates = React.useMemo(() => undefined, [profits]);
   // Stryker restore ArrayDeclaration
 
killedBy: ProfitsTable tests renders without crashing for 0 profits
statusReason: Cannot read properties of undefined (reading 'forEach')
