[Killed] StringLiteral
main/components/Jobs/JobsTable.jsx:16:16
       accessor: "id", // accessor is the "key" in the data
     },
     DateColumn("Created", (cell) => cell.row.original.createdAt),
-    DateColumn("Updated", (cell) => cell.row.original.updatedAt),
+    DateColumn("", (cell) => cell.row.original.updatedAt),
     {
       Header: "Status",
killedBy: JobsTable tests renders without crashing for empty table
statusReason: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Jobs/JobsTable.jsx:21:28
       Header: "Status",
       accessor: "status",
     },
-    PlaintextColumn("Log", (cell) => cell.row.original.log),
+    PlaintextColumn("Log", () => undefined),
   ];
 
killedBy: JobsTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job!Goodbye from test job!
Received:
