[Killed] StringLiteral
main/components/Jobs/PagedJobsTable.jsx:10:18
 import { useBackend } from "main/utils/useBackend";
 
 const PagedJobsTable = () => {
-  const testId = "PagedJobsTable";
+  const testId = "";
   const refreshJobsIntervalMilliseconds = 5000;
 
killedBy: PagedJobsTable tests renders correct content
statusReason: Unable to find an element by: [data-testid="PagedJobsTable-next-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Page: 
      1

[Killed] ConditionalExpression
main/components/Jobs/PagedJobsTable.jsx:78:19
       <Button
         data-testid={`${testId}-previous-button`}
         onClick={previousPageCallback()}
-        disabled={selectedPage === 0}
+        disabled={true}
       >
         Previous
killedBy: PagedJobsTable tests renders correct content with multiple pages
statusReason: expect(element).toBeEnabled()

Received element is not enabled:
  <button
  class="btn btn-primary"
  data-testid="PagedJobsTable-previous-button"
  disabled=""
  type="button"

[Killed] ArithmeticOperator
main/components/Jobs/PagedJobsTable.jsx:85:61
       <Button
         data-testid={`${testId}-next-button`}
         onClick={nextPageCallback()}
-        disabled={page.totalPages === 0 || selectedPage === page.totalPages - 1}
+        disabled={page.totalPages === 0 || selectedPage === page.totalPages + 1}
       >
         Next
killedBy: PagedJobsTable tests renders correct content
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  data-testid="PagedJobsTable-next-button"
  type="button"
/>
