[Killed] StringLiteral
main/components/Jobs/TestJobForm.jsx:44:39
           isInvalid={!!errors.sleepMs}
           {...register("sleepMs", {
             required: "sleepMs is required (0 is ok)",
-            min: { value: 0, message: "sleepMs must be positive" },
+            min: { value: 0, message: "" },
             max: { value: 60000, message: "sleepMs must be ≤ 60000" },
           })}
killedBy: TestJobsForm tests validates that sleepMs is >= 0
statusReason: Unable to find an element with the text: /sleepMs must be positive/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
