[Killed] ArrowFunction
src/main/components/OurTable.jsx:45:29
     <div {...getTableProps()}>
       <Table style={tableStyle} {...getTableProps()} striped bordered hover>
         <thead>
-          {headerGroups.map((headerGroup) => (
-            <tr {...headerGroup.getHeaderGroupProps()}>
-              {headerGroup.headers.map((column) => (
-                <th
-                  {...column.getHeaderProps(column.getSortByToggleProps())}
-                  data-testid={`${testid}-header-${column.id}`}
-                >
-                  {column.render("Header")}
-                  <span
-                    data-testid={`${testid}-header-${column.id}-sort-carets`}
-                  >
-                    {column.isSorted
-                      ? column.isSortedDesc
-                        ? " 🔽"
-                        : " 🔼"
-                      : ""}
-                  </span>
-                </th>
-              ))}
-            </tr>
-          ))}
+          {headerGroups.map(() => undefined)}
         </thead>
         <tbody {...getTableBodyProps()}>
killedBy: PagedJobsTable tests renders correct content
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Page: 
      1

[Killed] ArrowFunction
src/main/components/OurTable.jsx:47:40
         <thead>
           {headerGroups.map((headerGroup) => (
             <tr {...headerGroup.getHeaderGroupProps()}>
-              {headerGroup.headers.map((column) => (
-                <th
-                  {...column.getHeaderProps(column.getSortByToggleProps())}
-                  data-testid={`${testid}-header-${column.id}`}
-                >
-                  {column.render("Header")}
-                  <span
-                    data-testid={`${testid}-header-${column.id}-sort-carets`}
-                  >
-                    {column.isSorted
-                      ? column.isSortedDesc
-                        ? " 🔽"
-                        : " 🔼"
-                      : ""}
-                  </span>
-                </th>
-              ))}
+              {headerGroup.headers.map(() => undefined)}
             </tr>
           ))}
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
src/main/components/OurTable.jsx:58:27
                   >
                     {column.isSorted
                       ? column.isSortedDesc
-                        ? " 🔽"
+                        ? ""
                         : " 🔼"
                       : ""}
killedBy: PagedProfitsTable tests renders correct content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:

[Killed] ArithmeticOperator
src/main/components/OurTable.jsx:69:42
         </thead>
         <tbody {...getTableBodyProps()}>
           {rows
-            .slice(pageIndex * pageSize, (pageIndex + 1) * pageSize)
+            .slice(pageIndex * pageSize, (pageIndex + 1) / pageSize)
             .map((row) => {
               prepareRow(row);
killedBy: OurTable tests button appears in the table and triggers callback on click
statusReason: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] BlockStatement
src/main/components/OurTable.jsx:70:27
         <tbody {...getTableBodyProps()}>
           {rows
             .slice(pageIndex * pageSize, (pageIndex + 1) * pageSize)
-            .map((row) => {
-              prepareRow(row);
-              return (
-                <tr {...row.getRowProps()}>
-                  {row.cells.map((cell, _index) => {
-                    return (
-                      <td
-                        {...cell.getCellProps()}
-                        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                      >
-                        {cell.render("Cell")}
-                      </td>
-                    );
-                  })}
-                </tr>
-              );
-            })}
+            .map((row) => {})}
         </tbody>
       </Table>
killedBy: OurTable tests button appears in the table and triggers callback on click
statusReason: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] BlockStatement
src/main/components/OurTable.jsx:74:52
               prepareRow(row);
               return (
                 <tr {...row.getRowProps()}>
-                  {row.cells.map((cell, _index) => {
-                    return (
-                      <td
-                        {...cell.getCellProps()}
-                        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                      >
-                        {cell.render("Cell")}
-                      </td>
-                    );
-                  })}
+                  {row.cells.map((cell, _index) => {})}
                 </tr>
               );
killedBy: OurTable tests button appears in the table and triggers callback on click
statusReason: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] EqualityOperator
src/main/components/OurTable.jsx:89:8
             })}
         </tbody>
       </Table>
-      {rows.length > pageSize && (
+      {rows.length >= pageSize && (
         <div style={paginationStyle}>
           <Pagination {...getTableProps()}>
killedBy: OurTable tests renders a table with 10 rows and tests that pagination isn't visible when there are exactly as many rows as rows per page
statusReason: expected <span class="page-link" …(1)>…(2)</span> to be null // Object.is equality

[Killed] EqualityOperator
src/main/components/OurTable.jsx:95:25
             <Pagination.Prev
               onClick={() => setPageIndex(pageIndex - 1)}
               data-testid={`${testid}-prev-page-button`}
-              disabled={pageIndex === 0}
+              disabled={pageIndex !== 0}
             />
             {pageIndex > 3 && (
killedBy: OurTable tests renders a table with 11 rows and clicks on the next page button and previous page button
statusReason: expect(element).toHaveClass("disabled")

Expected the element to have class:
  disabled
Received:
  page-item

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:97:14
               data-testid={`${testid}-prev-page-button`}
               disabled={pageIndex === 0}
             />
-            {pageIndex > 3 && (
-              <Pagination.Item
-                onClick={() => setPageIndex(0)}
-                data-testid={`${testid}-first-page-button`}
-              >
-                {1}
-              </Pagination.Item>
-            )}
+            {true}
             {pageIndex > 4 && (
               <Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />
killedBy: OurTable tests renders a table with 51 rows and tests the first and last page buttons
statusReason: Unable to find an element by: [data-testid="testid-first-page-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:97:14
               data-testid={`${testid}-prev-page-button`}
               disabled={pageIndex === 0}
             />
-            {pageIndex > 3 && (
+            {true && (
               <Pagination.Item
                 onClick={() => setPageIndex(0)}
killedBy: OurTable tests renders a table with 51 rows and tests the first and last page buttons
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  class="page-link"
  data-testid="testid-first-page-button"
  href="#"
  role="button"
  tabindex="0"

[Killed] LogicalOperator
src/main/components/OurTable.jsx:105:14
                 {1}
               </Pagination.Item>
             )}
-            {pageIndex > 4 && (
-              <Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />
-            )}
+            {pageIndex > 4 || <Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />}
             {pageIndex === 4 && (
               <Pagination.Item
killedBy: OurTable tests renders a table with 51 rows and tests the first page
statusReason: expected <a class="page-link" …(4)>…(2)</a> to be null // Object.is equality

[Killed] EqualityOperator
src/main/components/OurTable.jsx:105:14
                 {1}
               </Pagination.Item>
             )}
-            {pageIndex > 4 && (
+            {pageIndex <= 4 && (
               <Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />
             )}
killedBy: OurTable tests renders a table with 51 rows and tests the first page
statusReason: expected <a class="page-link" …(4)>…(2)</a> to be null // Object.is equality

[Killed] LogicalOperator
src/main/components/OurTable.jsx:108:14
             {pageIndex > 4 && (
               <Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />
             )}
-            {pageIndex === 4 && (
-              <Pagination.Item
-                onClick={() => setPageIndex(pageIndex - 3)}
-                data-testid={`${testid}-back-three-page-button`}
-              >
-                {pageIndex - 2}
-              </Pagination.Item>
-            )}
+            {pageIndex === 4 || <Pagination.Item onClick={() => setPageIndex(pageIndex - 3)} data-testid={`${testid}-back-three-page-button`}>
+                {pageIndex - 2}
+              </Pagination.Item>}
             {pageIndex > 1 && (
               <Pagination.Item
killedBy: OurTable tests renders a table with 51 rows and tests the first page
statusReason: expected <a class="page-link" …(4)></a> to be null // Object.is equality

[Killed] LogicalOperator
src/main/components/OurTable.jsx:116:14
                 {pageIndex - 2}
               </Pagination.Item>
             )}
-            {pageIndex > 1 && (
-              <Pagination.Item
-                onClick={() => setPageIndex(pageIndex - 2)}
-                data-testid={`${testid}-back-two-page-button`}
-              >
-                {pageIndex - 1}
-              </Pagination.Item>
-            )}
+            {pageIndex > 1 || <Pagination.Item onClick={() => setPageIndex(pageIndex - 2)} data-testid={`${testid}-back-two-page-button`}>
+                {pageIndex - 1}
+              </Pagination.Item>}
             {pageIndex > 0 && (
               <Pagination.Item
killedBy: OurTable tests renders a table with 51 rows and tests the first page
statusReason: expected <a class="page-link" …(4)></a> to be null // Object.is equality

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:116:14
                 {pageIndex - 2}
               </Pagination.Item>
             )}
-            {pageIndex > 1 && (
-              <Pagination.Item
-                onClick={() => setPageIndex(pageIndex - 2)}
-                data-testid={`${testid}-back-two-page-button`}
-              >
-                {pageIndex - 1}
-              </Pagination.Item>
-            )}
+            {false}
             {pageIndex > 0 && (
               <Pagination.Item
killedBy: OurTable tests renders a table with 51 rows and tests the first and last page buttons
statusReason: Unable to find an element by: [data-testid="testid-back-two-page-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
src/main/components/OurTable.jsx:119:30
             {pageIndex > 1 && (
               <Pagination.Item
                 onClick={() => setPageIndex(pageIndex - 2)}
-                data-testid={`${testid}-back-two-page-button`}
+                data-testid={``}
               >
                 {pageIndex - 1}
killedBy: OurTable tests renders a table with 51 rows and tests the first and last page buttons
statusReason: Unable to find an element by: [data-testid="testid-back-two-page-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] LogicalOperator
src/main/components/OurTable.jsx:124:14
                 {pageIndex - 1}
               </Pagination.Item>
             )}
-            {pageIndex > 0 && (
-              <Pagination.Item
-                onClick={() => setPageIndex(pageIndex - 1)}
-                data-testid={`${testid}-back-one-page-button`}
-              >
-                {pageIndex}
-              </Pagination.Item>
-            )}
+            {pageIndex > 0 || <Pagination.Item onClick={() => setPageIndex(pageIndex - 1)} data-testid={`${testid}-back-one-page-button`}>
+                {pageIndex}
+              </Pagination.Item>}
             <Pagination.Item
               data-testid={`${testid}-current-page-button`}
killedBy: OurTable tests renders a table with 51 rows and tests the first page
statusReason: expected <a class="page-link" …(4)></a> to be null // Object.is equality

[Killed] EqualityOperator
src/main/components/OurTable.jsx:124:14
                 {pageIndex - 1}
               </Pagination.Item>
             )}
-            {pageIndex > 0 && (
+            {pageIndex <= 0 && (
               <Pagination.Item
                 onClick={() => setPageIndex(pageIndex - 1)}
killedBy: OurTable tests renders a table with 51 rows and tests the first page
statusReason: expected <a class="page-link" …(4)></a> to be null // Object.is equality
