[Killed] StringLiteral
src/main/pages/AdminAnnouncementsPage.jsx:34:21
             <h2>Announcements for Commons: {commonsName}</h2>
             <Button
               variant="primary"
-              href={`/admin/announcements/${commonsId}/create`}
+              href={``}
             >
               Create Announcement
killedBy: AdminCreateAnnouncementsPage tests correct href for create announcements button as an admin
statusReason: expect(element).toHaveAttribute("href", "/admin/announcements/1/create") // element.getAttribute("href") === "/admin/announcements/1/create"

Expected the element to have attribute:
  href="/admin/announcements/1/create"
Received:
  href=""
