[Killed] ArrowFunction
src/main/pages/AdminCreateCommonsPage.jsx:10:31
 import { useBackendMutation } from "main/utils/useBackend";
 
 const AdminCreateCommonsPage = () => {
-  const objectToAxiosParams = (newCommons) => ({
-    url: "/api/commons/new",
-    method: "POST",
-    data: newCommons,
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (commons) => {
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminCreateCommonsPage.jsx:10:48
 import { useBackendMutation } from "main/utils/useBackend";
 
 const AdminCreateCommonsPage = () => {
-  const objectToAxiosParams = (newCommons) => ({
-    url: "/api/commons/new",
-    method: "POST",
-    data: newCommons,
-  });
+  const objectToAxiosParams = (newCommons) => ({});
 
   const onSuccess = (commons) => {
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminCreateCommonsPage.jsx:16:34
     data: newCommons,
   });
 
-  const onSuccess = (commons) => {
-    toast(
-      <div>
-        Commons successfully created!
-        <br />
-        {`id: ${commons.id}`}
-        <br />
-        {`name: ${commons.name}`}
-        <br />
-        {`startDate: ${commons.startingDate}`}
-        <br />
-        {`lastDate: ${commons.lastDate}`}
-        <br />
-        {`cowPrice: ${commons.cowPrice}`}
-        <br />
-        {`capacityPerUser: ${commons.capacityPerUser}`}
-        <br />
-        {`carryingCapacity: ${commons.carryingCapacity}`}
-      </div>,
-    );
-  };
+  const onSuccess = (commons) => {};
 
   // Stryker disable all
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: expected "spy" to be called with arguments: [ { …(9) } ]

Number of calls: 0

[Killed] StringLiteral
src/main/pages/AdminCreateCommonsPage.jsx:31:10
         <br />
         {`cowPrice: ${commons.cowPrice}`}
         <br />
-        {`capacityPerUser: ${commons.capacityPerUser}`}
+        {``}
         <br />
         {`carryingCapacity: ${commons.carryingCapacity}`}
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: expected "spy" to be called with arguments: [ { …(9) } ]

Received: 

  1st spy call:

@@ -10,10 +10,9 @@
      <br />

[Killed] StringLiteral
src/main/pages/AdminCreateCommonsPage.jsx:33:10
         <br />
         {`capacityPerUser: ${commons.capacityPerUser}`}
         <br />
-        {`carryingCapacity: ${commons.carryingCapacity}`}
+        {``}
       </div>,
     );
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: expected "spy" to be called with arguments: [ { …(9) } ]

Received: 

  1st spy call:

@@ -12,8 +12,7 @@
      <br />
