[Killed] ObjectLiteral
src/main/pages/AdminEditCommonsPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/commons?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/commons`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find a label with the text of: /Commons Name/

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/AdminEditCommonsPage.jsx:21:12
     {
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
-      url: `/api/commons`,
+      url: ``,
       params: {
         id,
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find a label with the text of: /Commons Name/

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
src/main/pages/AdminEditCommonsPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (commons) => ({
-    url: "/api/commons/update",
-    method: "PUT",
-    params: {
-      id: commons.id,
-    },
-    data: {
-      name: commons.name,
-      startingBalance: commons.startingBalance,
-      cowPrice: commons.cowPrice,
-      milkPrice: commons.milkPrice,
-      startingDate: commons.startingDate,
-      lastDate: commons.lastDate,
-      degradationRate: commons.degradationRate,
-      capacityPerUser: commons.capacityPerUser,
-      carryingCapacity: commons.carryingCapacity,
-      aboveCapacityHealthUpdateStrategy:
-        commons.aboveCapacityHealthUpdateStrategy,
-      belowCapacityHealthUpdateStrategy:
-        commons.belowCapacityHealthUpdateStrategy,
-      showLeaderboard: commons.showLeaderboard,
-      showChat: commons.showChat,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (_, commons) => {
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminEditCommonsPage.jsx:34:11
     params: {
       id: commons.id,
     },
-    data: {
-      name: commons.name,
-      startingBalance: commons.startingBalance,
-      cowPrice: commons.cowPrice,
-      milkPrice: commons.milkPrice,
-      startingDate: commons.startingDate,
-      lastDate: commons.lastDate,
-      degradationRate: commons.degradationRate,
-      capacityPerUser: commons.capacityPerUser,
-      carryingCapacity: commons.carryingCapacity,
-      aboveCapacityHealthUpdateStrategy:
-        commons.aboveCapacityHealthUpdateStrategy,
-      belowCapacityHealthUpdateStrategy:
-        commons.belowCapacityHealthUpdateStrategy,
-      showLeaderboard: commons.showLeaderboard,
-      showChat: commons.showChat,
-    },
+    data: {},
   });
 
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/pages/AdminEditCommonsPage.jsx:53:37
     },
   });
 
-  const onSuccess = (_, commons) => {
-    toast(`Commons Updated - id: ${commons.id} name: ${commons.name}`);
-  };
+  const onSuccess = (_, commons) => {};
 
   const mutation = useBackendMutation(
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/pages/AdminEditCommonsPage.jsx:70:18
     mutation.mutate(data);
   };
 
-  if (isSuccess) {
-    return <Navigate to="/admin/listcommons" />;
-  }
+  if (isSuccess) {}
 
   return (
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/AdminEditCommonsPage.jsx:78:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Commons</h1>
-        {commons && (
-          <CommonsForm
-            initialCommons={commons}
-            submitAction={submitAction}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find a label with the text of: /Commons Name/

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/AdminEditCommonsPage.jsx:78:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Commons</h1>
-        {commons && (
-          <CommonsForm
-            initialCommons={commons}
-            submitAction={submitAction}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find a label with the text of: /Commons Name/

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
