[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.jsx:58:56
 
   // *** UpdateCowHealth job ***
 
-  const objectToAxiosParamsUpdateCowHealthJob = () => ({
-    url: `/api/jobs/launch/updatecowhealth`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCowHealthJob = () => ({});
 
   const objectToAxiosParamsUpdateCowHealthJobSingle = (data) => ({
killedBy: AdminJobsPage tests user can submit update cow health job for all commons
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:103:13
 
   const objectToAxiosParamsMilkTheCowsJobSingle = (data) => ({
     url: `/api/jobs/launch/milkthecowjobsinglecommons?commonsId=${data.selectedCommons}`,
-    method: "POST",
+    method: "",
   });
 
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:155:12
 
   const objectToAxiosParamsInstructorReportSpecificCommonsJob = (data) => {
     return {
-      url: `/api/jobs/launch/instructorreportsinglecommons?commonsId=${data.selectedCommons}`,
+      url: ``,
       method: "POST",
     };
killedBy: AdminJobsPage tests user can submit instructor report (specific commons) job
statusReason: expected '' to be '/api/jobs/launch/instructorreportsing…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.jsx:190:5
       name: "Milk The Cows",
       form: <MilkCowsJobForm submitAction={submitMilkTheCowsJob} />,
     },
-    {
-      name: "Instructor Report",
-      form: <InstructorReportForm submitAction={submitInstructorReportJob} />,
-    },
+    {},
     {
       name: "Instructor Report (for specific commons)",
killedBy: AdminJobsPage tests renders without crashing
statusReason: Unable to find an element with the text: Instructor Report. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.jsx:194:5
       name: "Instructor Report",
       form: <InstructorReportForm submitAction={submitInstructorReportJob} />,
     },
-    {
-      name: "Instructor Report (for specific commons)",
-      form: (
-        <InstructorReportSpecificCommonsForm
-          submitAction={submitInstructorReportSpecificCommonsJob}
-        />
-      ),
-    },
+    {},
   ];
 
killedBy: AdminJobsPage tests user can submit instructor report (specific commons) job
statusReason: Unable to find an element with the text: Instructor Report (for specific commons). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
