[Killed] BlockStatement
src/main/pages/AdminReportsPage.jsx:6:44
 import { useBackend } from "main/utils/useBackend";
 import ReportTable from "main/components/Reports/ReportTable";
 
-export default function AdminReportsPage() {
-  // Stryker disable  all
-  const {
-    data: reports,
-    error: _error,
-    status: _status,
-  } = useBackend(["/api/reports"], { method: "GET", url: "/api/reports" }, []);
-  // Stryker restore all
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Instructor Reports</h1>
-        <ReportTable reports={reports} />
-      </div>
-    </BasicLayout>
-  );
-}
+export default function AdminReportsPage() {}
 
killedBy: AdminReportsPage tests renders correctly for admin user
statusReason: Unable to find an element with the text: Instructor Reports. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
