[Killed] ObjectLiteral
src/main/pages/AdminViewPlayPage.jsx:61:27
     setIsChatOpen((prevState) => !prevState);
   };
 
-  const chatButtonStyle = {
-    width: "40px",
-    height: "40px",
-    borderRadius: "50%",
-    backgroundColor: "lightblue",
-    color: "black",
-    position: "fixed",
-    bottom: "20px",
-    right: "20px",
-  };
+  const chatButtonStyle = {};
 
   const chatContainerStyle = {
killedBy: AdminViewPlayPage tests Chat button and container have correct styles
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- background-color: lightblue;
- border-radius: 50%;
- bottom: 20px;

[Killed] StringLiteral
src/main/pages/AdminViewPlayPage.jsx:63:13
 
   const chatButtonStyle = {
     width: "40px",
-    height: "40px",
+    height: "",
     borderRadius: "50%",
     backgroundColor: "lightblue",
killedBy: AdminViewPlayPage tests Chat button and container have correct styles
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

  background-color: lightblue;
  border-radius: 50%;
  bottom: 20px;

[Killed] StringLiteral
src/main/pages/AdminViewPlayPage.jsx:66:12
     height: "40px",
     borderRadius: "50%",
     backgroundColor: "lightblue",
-    color: "black",
+    color: "",
     position: "fixed",
     bottom: "20px",
killedBy: AdminViewPlayPage tests Chat button and container have correct styles
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

  background-color: lightblue;
  border-radius: 50%;
  bottom: 20px;

[Killed] StringLiteral
src/main/pages/AdminViewPlayPage.jsx:68:13
     backgroundColor: "lightblue",
     color: "black",
     position: "fixed",
-    bottom: "20px",
+    bottom: "",
     right: "20px",
   };
killedBy: AdminViewPlayPage tests Chat button and container have correct styles
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

  background-color: lightblue;
  border-radius: 50%;
- bottom: 20px;

[Killed] StringLiteral
src/main/pages/AdminViewPlayPage.jsx:80:17
   };
 
   const bannerStyle = {
-    background: "#f0f0f0",
+    background: "",
     padding: "10px",
     textAlign: "center",
killedBy: AdminViewPlayPage tests displays read-only banner
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- background: rgb(240, 240, 240);
  padding: 10px;
- textAlign: center;

[Killed] StringLiteral
src/main/pages/AdminViewPlayPage.jsx:82:16
   const bannerStyle = {
     background: "#f0f0f0",
     padding: "10px",
-    textAlign: "center",
+    textAlign: "",
   };
 
killedBy: AdminViewPlayPage tests displays read-only banner
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

  background: rgb(240, 240, 240);
  padding: 10px;
- textAlign: center;

[Killed] OptionalChaining
src/main/pages/AdminViewPlayPage.jsx:85:25
     textAlign: "center",
   };
 
-  const visiting_user = userCommons?.username;
+  const visiting_user = userCommons.username;
   const visiting_commons = commonsPlus?.commons.name;
   // Stryker disable all
killedBy: AdminViewPlayPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'username')

[Killed] OptionalChaining
src/main/pages/AdminViewPlayPage.jsx:86:28
   };
 
   const visiting_user = userCommons?.username;
-  const visiting_commons = commonsPlus?.commons.name;
+  const visiting_commons = commonsPlus.commons.name;
   // Stryker disable all
   const admin_name = currentUser?.root ? currentUser?.root?.user?.fullName : "";
killedBy: AdminViewPlayPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'commons')

[Killed] ConditionalExpression
src/main/pages/AdminViewPlayPage.jsx:108:12
           </Card.Body>
         </Card>
         <Container>
-          {!!currentUser && <CommonsPlay currentUser={userCommons} />}
+          {false}
           {!!commonsPlus && (
             <CommonsOverview
killedBy: AdminViewPlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Unable to find an element by: [data-testid="CommonsPlay"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="d-flex flex-column min-vh-100"

[Killed] ConditionalExpression
src/main/pages/AdminViewPlayPage.jsx:108:12
           </Card.Body>
         </Card>
         <Container>
-          {!!currentUser && <CommonsPlay currentUser={userCommons} />}
+          {true}
           {!!commonsPlus && (
             <CommonsOverview
killedBy: AdminViewPlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Unable to find an element by: [data-testid="CommonsPlay"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="d-flex flex-column min-vh-100"

[Killed] ConditionalExpression
src/main/pages/AdminViewPlayPage.jsx:109:12
         </Card>
         <Container>
           {!!currentUser && <CommonsPlay currentUser={userCommons} />}
-          {!!commonsPlus && (
-            <CommonsOverview
-              commonsPlus={commonsPlus}
-              currentUser={currentUser}
-            />
-          )}
+          {true}
           <br />
           {!!userCommons && !!commonsPlus && (
killedBy: AdminViewPlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Unable to find an element with the text: /Announcements/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="d-flex flex-column min-vh-100"

[Killed] BooleanLiteral
src/main/pages/AdminViewPlayPage.jsx:109:13
         </Card>
         <Container>
           {!!currentUser && <CommonsPlay currentUser={userCommons} />}
-          {!!commonsPlus && (
+          {!commonsPlus && (
             <CommonsOverview
               commonsPlus={commonsPlus}
killedBy: AdminViewPlayPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'commons')

[Killed] LogicalOperator
src/main/pages/AdminViewPlayPage.jsx:116:12
             />
           )}
           <br />
-          {!!userCommons && !!commonsPlus && (
-            <CardGroup data-testid="adminviewplaypage-card-group">
-              <ManageCows
-                userCommons={userCommons}
-                commons={commonsPlus.commons}
-              />
-              <FarmStats userCommons={userCommons} />
-              <Profits userCommons={userCommons} profits={userCommonsProfits} />
-            </CardGroup>
-          )}
+          {!!userCommons && !!commonsPlus || <CardGroup data-testid="adminviewplaypage-card-group">
+              <ManageCows userCommons={userCommons} commons={commonsPlus.commons} />
+              <FarmStats userCommons={userCommons} />
+              <Profits userCommons={userCommons} profits={userCommonsProfits} />
+            </CardGroup>}
         </Container>
       </BasicLayout>
killedBy: AdminViewPlayPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'commons')

[Killed] LogicalOperator
src/main/pages/AdminViewPlayPage.jsx:129:10
         </Container>
       </BasicLayout>
       <div style={chatContainerStyle} data-testid="adminviewplaypage-chat-div">
-        {!!isChatOpen && <ChatPanel commonsId={userId} />}
+        {!!isChatOpen || <ChatPanel commonsId={userId} />}
         <Button
           style={chatButtonStyle}
killedBy: AdminViewPlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="vstack gap-2"
  data-testid="ChatPanel"
  style="background-color: white;"
>
  <div

[Killed] BooleanLiteral
src/main/pages/AdminViewPlayPage.jsx:129:11
         </Container>
       </BasicLayout>
       <div style={chatContainerStyle} data-testid="adminviewplaypage-chat-div">
-        {!!isChatOpen && <ChatPanel commonsId={userId} />}
+        {!isChatOpen && <ChatPanel commonsId={userId} />}
         <Button
           style={chatButtonStyle}
killedBy: AdminViewPlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="vstack gap-2"
  data-testid="ChatPanel"
  style="background-color: white;"
>
  <div

[Killed] StringLiteral
src/main/pages/AdminViewPlayPage.jsx:135:31
           onClick={toggleChatWindow}
           data-testid="adminviewplaypage-chat-toggle"
         >
-          {isChatOpen ? "▼" : "▲"}
+          {isChatOpen ? "▼" : ""}
         </Button>
       </div>
killedBy: AdminViewPlayPage tests Chat button and container have correct styles
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  ▲
Received:
