[Killed] ArrowFunction
src/main/pages/AdminViewReportPage.jsx:47:24
           <Col>
             <Button
               variant="primary"
-              onClick={() => navigate("/admin/reports")}
+              onClick={() => undefined}
             >
               Back to Reports
killedBy: AdminViewReportPage tests back to reports button navigates correctly
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/main/pages/AdminViewReportPage.jsx:53:56
             </Button>
           </Col>
         </Row>
-        <ReportTable reports={[reportHeader]} buttons={false} />
+        <ReportTable reports={[reportHeader]} buttons={true} />
         <ReportHeaderTable report={reportHeader} />
         <Row className="pt-5">
killedBy: AdminViewReportPage tests back to reports button navigates correctly
statusReason: Found multiple elements with the text: View Report

Here are the matching elements:

Ignored nodes: comments, script, style
<th
  colspan="1"
  data-testid="ReportTable-header-View Report"

[Killed] ArrayDeclaration
src/main/pages/AdminViewReportPage.jsx:53:31
             </Button>
           </Col>
         </Row>
-        <ReportTable reports={[reportHeader]} buttons={false} />
+        <ReportTable reports={[]} buttons={false} />
         <ReportHeaderTable report={reportHeader} />
         <Row className="pt-5">
killedBy: AdminViewReportPage tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="ReportTable-cell-row-0-col-numUsers"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
