[Killed] ArrowFunction
src/main/pages/HomePage.jsx:27:31
   );
   // Stryker restore all
 
-  const objectToAxiosParams = (newCommonsId) => ({
-    url: "/api/commons/join",
-    method: "POST",
-    params: {
-      commonsId: newCommonsId,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   // Stryker disable all : it is acceptable to exclude useBackendMutation calls from mutation testing
killedBy: HomePage tests Calls the callback when you click join
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/HomePage.jsx:30:13
   const objectToAxiosParams = (newCommonsId) => ({
     url: "/api/commons/join",
     method: "POST",
-    params: {
-      commonsId: newCommonsId,
-    },
+    params: {},
   });
 
killedBy: HomePage tests Calls the callback when you click join
statusReason: expected {} to deeply equal { commonsId: 4 }

[Killed] BlockStatement
src/main/pages/HomePage.jsx:55:36
   // Stryker restore all
 
   let navigate = useNavigate();
-  const visitButtonClick = (id) => {
-    navigate("/play/" + id);
-  };
+  const visitButtonClick = (id) => {};
 
   //create a list of commons that the user hasn't joined for use in the "Join a New Commons" list.
killedBy: HomePage tests Redirects to the PlayPage when you click visit
statusReason: expected "spy" to be called with arguments: [ '/play/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/main/pages/HomePage.jsx:56:14
 
   let navigate = useNavigate();
   const visitButtonClick = (id) => {
-    navigate("/play/" + id);
+    navigate("" + id);
   };
 
killedBy: HomePage tests Redirects to the PlayPage when you click visit
statusReason: expected "spy" to be called with arguments: [ '/play/1' ]

Received: 

  1st spy call:

  [
-   "/play/1",

[Killed] ObjectLiteral
src/main/pages/HomePage.jsx:65:14
   return (
     <div
       data-testid={"HomePage-main-div"}
-      style={{ backgroundSize: "cover", backgroundImage: `url(${Background})` }}
+      style={{}}
     >
       <BasicLayout>
killedBy: HomePage tests Home page intro card has the correct styles applied
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- backgroundSize: cover;

[Killed] StringLiteral
src/main/pages/HomePage.jsx:68:28
       style={{ backgroundSize: "cover", backgroundImage: `url(${Background})` }}
     >
       <BasicLayout>
-        <Card data-testid={"HomePage-intro-card"} className="woodentitle">
+        <Card data-testid={""} className="woodentitle">
           <div className="text-center border-0 my-3">
             <h1 data-testid="homePage-title" className="animate-charcter">
killedBy: HomePage tests Home page intro card has the correct styles applied
statusReason: Unable to find an element by: [data-testid="HomePage-intro-card"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="HomePage-main-div"
      style="background-size: cover; background-image: url(/src/assets/HomePageBackground-day.jpg);"

[Killed] StringLiteral
src/main/pages/HomePage.jsx:90:29
               <CommonsList
                 commonList={commonsJoined}
                 title="Visit A Commons"
-                buttonText={"Visit"}
+                buttonText={""}
                 buttonLink={visitButtonClick}
               />
killedBy: HomePage tests Redirects to the PlayPage when you click visit
statusReason: Unable to find an element by: [data-testid="commonsCard-button-Visit-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="HomePage-main-div"
      style="background-size: cover; background-image: url(/src/assets/HomePageBackground-day.jpg);"
