[Killed] ConditionalExpression
src/main/pages/LeaderboardPage.jsx:61:5
   const navigate = useNavigate();
 
   const showLeaderboard =
-    hasRole(currentUser, "ROLE_ADMIN") || commons.showLeaderboard;
+    false;
   return (
     <div
killedBy: LeaderboardPage tests renders leaderboard for users when showLeaderboard = true
statusReason: Unable to find an element with the text: Total Wealth. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="LeaderboardPage-main-div"
      style="background-size: cover; background-image: url(/src/assets/

[Killed] LogicalOperator
src/main/pages/LeaderboardPage.jsx:61:5
   const navigate = useNavigate();
 
   const showLeaderboard =
-    hasRole(currentUser, "ROLE_ADMIN") || commons.showLeaderboard;
+    hasRole(currentUser, "ROLE_ADMIN") && commons.showLeaderboard;
   return (
     <div
killedBy: LeaderboardPage tests renders leaderboard for users when showLeaderboard = true
statusReason: Unable to find an element with the text: Total Wealth. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="LeaderboardPage-main-div"
      style="background-size: cover; background-image: url(/src/assets/

[Killed] ObjectLiteral
src/main/pages/LeaderboardPage.jsx:65:14
   return (
     <div
       data-testid={"LeaderboardPage-main-div"}
-      style={{
-        backgroundSize: "cover",
-        backgroundImage: `url(${Background})`,
-      }}
+      style={{}}
     >
       <BasicLayout>
killedBy: LeaderboardPage tests renders without crashing for users
statusReason: expect(element).toHaveAttribute("style", "background-size: cover; background-image: url(/src/assets/PlayPageBackground.png);") // element.getAttribute("style") === "background-size: cover; background-image: url(/src/assets/PlayPageBackground.png);"

Expected the element to have attribute:
  style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.png);"
Received:
  null

[Killed] UnaryOperator
src/main/pages/LeaderboardPage.jsx:73:37
       <BasicLayout>
         <div className="pt-2 board">
           <Button
-            onClick={() => navigate(-1)}
+            onClick={() => navigate(+1)}
             data-testid="LeaderboardPage-back-button"
             style={{ float: "right" }}
killedBy: LeaderboardPage tests that navigate(-1) is called when Back is clicked
statusReason: expected "spy" to be called with arguments: [ -1 ]

Received: 

  1st spy call:

  [
-   -1,

[Killed] ArrowFunction
src/main/pages/LeaderboardPage.jsx:73:22
       <BasicLayout>
         <div className="pt-2 board">
           <Button
-            onClick={() => navigate(-1)}
+            onClick={() => undefined}
             data-testid="LeaderboardPage-back-button"
             style={{ float: "right" }}
killedBy: LeaderboardPage tests that navigate(-1) is called when Back is clicked
statusReason: expected "spy" to be called with arguments: [ -1 ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
src/main/pages/LeaderboardPage.jsx:75:20
           <Button
             onClick={() => navigate(-1)}
             data-testid="LeaderboardPage-back-button"
-            style={{ float: "right" }}
+            style={{}}
           >
             Back
killedBy: LeaderboardPage tests that navigate(-1) is called when Back is clicked
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
