[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:59:31
   );
   // Stryker restore all
 
-  const commonsPlusExists = !(typeof commonsPlus == "undefined");
+  const commonsPlusExists = !(false);
   let commonsforuser;
   let matched;
killedBy: PlayPage tests renders without crashing
statusReason: Cannot read properties of null (reading 'user')

[Killed] EqualityOperator
src/main/pages/PlayPage.jsx:59:31
   );
   // Stryker restore all
 
-  const commonsPlusExists = !(typeof commonsPlus == "undefined");
+  const commonsPlusExists = !(typeof commonsPlus != "undefined");
   let commonsforuser;
   let matched;
killedBy: PlayPage tests renders without crashing
statusReason: Cannot read properties of null (reading 'user')

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:65:44
 
   if (commonsPlusExists) {
     commonsforuser = currentUser.root.user.commons;
-    matched = commonsforuser.some((com) => com.id === commonsPlus.commons.id);
+    matched = commonsforuser.some((com) => true);
   }
 
killedBy: PlayPage tests User that has joined one commons is trying to access an unjoined common
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="woodentitle card"
  data-testid="commons-card"
>
  <div
    class="text-center border-0 my-3"

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:65:44
 
   if (commonsPlusExists) {
     commonsforuser = currentUser.root.user.commons;
-    matched = commonsforuser.some((com) => com.id === commonsPlus.commons.id);
+    matched = commonsforuser.some((com) => false);
   }
 
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Unable to find an element by: [data-testid="CommonsPlay"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] StringLiteral
src/main/pages/PlayPage.jsx:150:12
     color: "black",
     position: "fixed",
     bottom: "30px",
-    right: "30px",
+    right: "",
   };
 
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

@@ -2,7 +2,6 @@
  border-radius: 25%;
  bottom: 30px;

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:176:12
       <BasicLayout>
         <Container>
           {!commonsPlus && <h1>This commons does not exist!</h1>}
-          {notallowed && <h1>You have yet to join this commons!</h1>}
+          {notallowed || <h1>You have yet to join this commons!</h1>}
           {allowed && !!currentUser && (
             <CommonsPlay currentUser={currentUser} />
killedBy: PlayPage tests User that has joined one commons is trying to access an unjoined common
statusReason: Unable to find an element with the text: You have yet to join this commons!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] BooleanLiteral
src/main/pages/PlayPage.jsx:177:24
         <Container>
           {!commonsPlus && <h1>This commons does not exist!</h1>}
           {notallowed && <h1>You have yet to join this commons!</h1>}
-          {allowed && !!currentUser && (
+          {allowed && !currentUser && (
             <CommonsPlay currentUser={currentUser} />
           )}
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Unable to find an element by: [data-testid="CommonsPlay"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:177:12
         <Container>
           {!commonsPlus && <h1>This commons does not exist!</h1>}
           {notallowed && <h1>You have yet to join this commons!</h1>}
-          {allowed && !!currentUser && (
-            <CommonsPlay currentUser={currentUser} />
-          )}
+          {false}
 
           {!!commonsPlus && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Unable to find an element by: [data-testid="CommonsPlay"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:181:12
             <CommonsPlay currentUser={currentUser} />
           )}
 
-          {!!commonsPlus && (
-            <CommonsOverview
-              commonsPlus={commonsPlus}
-              currentUser={currentUser}
-            />
-          )}
+          {!!commonsPlus || <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser} />}
           <br />
           {!!userCommons && !!commonsPlus && (
killedBy: PlayPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'commons')

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:188:12
             />
           )}
           <br />
-          {!!userCommons && !!commonsPlus && (
-            <CardGroup>
-              <ManageCows
-                userCommons={userCommons}
-                commons={commonsPlus.commons}
-                setMessage={setMessage}
-                openModal={openModal}
-              />
-              <FarmStats userCommons={userCommons} />
-              <Profits userCommons={userCommons} profits={userCommonsProfits} />
-              <ManageCowsModal
-                number={numCows}
-                setNumber={setNumCows}
-                userCommons={userCommons}
-                isOpen={isModalOpen}
-                message={message}
-                onClose={closeModal}
-                onBuy={onBuy}
-                onSell={onSell}
-              />
-            </CardGroup>
-          )}
+          {true}
         </Container>
       </BasicLayout>
killedBy: PlayPage tests click buy button
statusReason: Unable to find an element by: [data-testid="buy-cow-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:212:8
           )}
         </Container>
       </BasicLayout>
-      {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (!!commonsPlus && commonsPlus.commons.showChat)) && (
-        <div style={chatContainerStyle} data-testid="playpage-chat-div">
-          {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
-          <Button
-            style={chatButtonStyle}
-            onClick={toggleChatWindow}
-            data-testid="playpage-chat-toggle"
-          >
-            {isChatOpen ? (
-              <span style={emojiStyle} data-testid="close-icon">
-                ❌
-              </span>
-            ) : (
-              <span style={emojiStyle} data-testid="message-icon">
-                💬
-              </span>
-            )}
-          </Button>
-        </div>
-      )}
+      {true}
     </div>
   );
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Unable to find an element by: [data-testid="playpage-chat-toggle"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:212:8
           )}
         </Container>
       </BasicLayout>
-      {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (!!commonsPlus && commonsPlus.commons.showChat)) && (
-        <div style={chatContainerStyle} data-testid="playpage-chat-div">
-          {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
-          <Button
-            style={chatButtonStyle}
-            onClick={toggleChatWindow}
-            data-testid="playpage-chat-toggle"
-          >
-            {isChatOpen ? (
-              <span style={emojiStyle} data-testid="close-icon">
-                ❌
-              </span>
-            ) : (
-              <span style={emojiStyle} data-testid="message-icon">
-                💬
-              </span>
-            )}
-          </Button>
-        </div>
-      )}
+      {false}
     </div>
   );
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Unable to find an element by: [data-testid="playpage-chat-toggle"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:213:10
         </Container>
       </BasicLayout>
       {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (!!commonsPlus && commonsPlus.commons.showChat)) && (
+        (false)) && (
         <div style={chatContainerStyle} data-testid="playpage-chat-div">
           {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Unable to find an element by: [data-testid="playpage-chat-toggle"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] BooleanLiteral
src/main/pages/PlayPage.jsx:213:11
         </Container>
       </BasicLayout>
       {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (!!commonsPlus && commonsPlus.commons.showChat)) && (
+        (!commonsPlus && commonsPlus.commons.showChat)) && (
         <div style={chatContainerStyle} data-testid="playpage-chat-div">
           {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
killedBy: PlayPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'commons')
