[Killed] BlockStatement
src/main/utils/useBackend.js:28:74
 //     []
 // );
 
-export function useBackend(queryKey, axiosParameters, initialData, rest) {
-  return useQuery({
-    queryKey: queryKey,
-    queryFn: async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return response.data;
-      } catch (e) {
-        // Stryker disable next-line OptionalChaining
-        if (e.response?.data?.message) {
-          toast.error(e.response.data.message);
-        } else {
-          const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-          toast.error(errorMessage);
-        }
-        throw e;
-      }
-    },
-    initialData: initialData,
-    ...rest,
-  });
-}
+export function useBackend(queryKey, axiosParameters, initialData, rest) {}
 
 const wrappedParams = async (params) => {
killedBy: SetCowHealthForm tests renders the fallback text correctlyl
statusReason: Cannot destructure property 'data' of '(0 , useBackend)(...)' as it is undefined.

[Killed] StringLiteral
src/main/utils/useBackend.js:40:32
         if (e.response?.data?.message) {
           toast.error(e.response.data.message);
         } else {
-          const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
+          const errorMessage = ``;
           toast.error(errorMessage);
         }
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error with no message
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Error communicating with backend via GET on /api/admin/users",

[Killed] BlockStatement
src/main/utils/useBackend.js:61:3
   objectToAxiosParams,
   useMutationParams,
   queryKey = null,
-) {
-  const queryClient = useQueryClient();
-
-  return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-    onError: (error) => {
-      // Stryker disable next-line OptionalChaining : we want to check if each nested object is there but we dont want to write tests for each specific case
-      if (error.response?.data?.message) {
-        toast.error(error.response.data.message);
-      } else {
-        const errorMessage = `Error communicating with backend via ${error.response.config.method} on ${error.response.config.url}`;
-        toast.error(errorMessage);
-      }
-    },
-    // Stryker disable all : Not sure how to set up the complex behavior needed to test this
-    onSettled: () => {
-      if (queryKey !== null) queryClient.invalidateQueries(queryKey);
-    },
-    // Stryker restore all
-    retry: false,
-    ...useMutationParams,
-  });
-}
+) {}
 
killedBy: ChatMessageCreate When you fill in the message form and click submit, the right things happen
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ObjectLiteral
src/main/utils/useBackend.js:64:78
 ) {
   const queryClient = useQueryClient();
 
-  return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-    onError: (error) => {
-      // Stryker disable next-line OptionalChaining : we want to check if each nested object is there but we dont want to write tests for each specific case
-      if (error.response?.data?.message) {
-        toast.error(error.response.data.message);
-      } else {
-        const errorMessage = `Error communicating with backend via ${error.response.config.method} on ${error.response.config.url}`;
-        toast.error(errorMessage);
-      }
-    },
-    // Stryker disable all : Not sure how to set up the complex behavior needed to test this
-    onSettled: () => {
-      if (queryKey !== null) queryClient.invalidateQueries(queryKey);
-    },
-    // Stryker restore all
-    retry: false,
-    ...useMutationParams,
-  });
+  return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {});
 }
 
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles success correctly
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/main/utils/useBackend.js:67:42
   return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
     onError: (error) => {
       // Stryker disable next-line OptionalChaining : we want to check if each nested object is there but we dont want to write tests for each specific case
-      if (error.response?.data?.message) {
-        toast.error(error.response.data.message);
-      } else {
+      if (error.response?.data?.message) {} else {
         const errorMessage = `Error communicating with backend via ${error.response.config.method} on ${error.response.config.url}`;
         toast.error(errorMessage);
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles error correctly with response message
statusReason: expected "spy" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
