[Killed] BlockStatement
src/main/utils/users.js:5:28
 import axios from "axios";
 import { useBackendMutation } from "./useBackend";
 
-export function useUsers() {
-  return useQuery(
-    "users",
-    async () => {
-      const uri = "/api/admin/users";
-      try {
-        const response = await axios.get(uri);
-        return response.data;
-      } catch (e) {
-        console.error(`Error getting data from ${uri}:`, e);
-        throw e;
-      }
-    },
-    {
-      initialData: [],
-    },
-  );
-}
+export function useUsers() {}
 
 export function useSuspendUser() {
killedBy: utils/users tests useUsers tests useUsers initially retrieves initial data on timeout
statusReason: Cannot read properties of undefined (reading 'isSuccess')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/main/utils/users.js:8:17
 export function useUsers() {
   return useQuery(
     "users",
-    async () => {
-      const uri = "/api/admin/users";
-      try {
-        const response = await axios.get(uri);
-        return response.data;
-      } catch (e) {
-        console.error(`Error getting data from ${uri}:`, e);
-        throw e;
-      }
-    },
+    async () => {},
     {
       initialData: [],
killedBy: utils/users tests useUsers tests useUsers initially retrieves initial data on timeout
statusReason: expected undefined to deeply equal []

[Killed] StringLiteral
src/main/utils/users.js:9:19
   return useQuery(
     "users",
     async () => {
-      const uri = "/api/admin/users";
+      const uri = "";
       try {
         const response = await axios.get(uri);
killedBy: utils/users tests useUsers tests useUsers initially retrieves initial data on timeout
statusReason: expected 'Error getting data from :' to match 'Error getting data from /api/admin/us…'

[Killed] BlockStatement
src/main/utils/users.js:13:19
       try {
         const response = await axios.get(uri);
         return response.data;
-      } catch (e) {
-        console.error(`Error getting data from ${uri}:`, e);
-        throw e;
-      }
+      } catch (e) {}
     },
     {
killedBy: utils/users tests useUsers tests useUsers initially retrieves initial data on timeout
statusReason: expected undefined to deeply equal []

[Killed] ObjectLiteral
src/main/utils/users.js:18:5
         throw e;
       }
     },
-    {
-      initialData: [],
-    },
+    {},
   );
 }
killedBy: utils/users tests useUsers tests useUsers initially retrieves initial data on timeout
statusReason: expected undefined to deeply equal []

[Killed] ArrayDeclaration
src/main/utils/users.js:19:20
       }
     },
     {
-      initialData: [],
+      initialData: ["Stryker was here"],
     },
   );
killedBy: utils/users tests useUsers tests useUsers initially retrieves initial data on timeout
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
src/main/utils/users.js:24:34
   );
 }
 
-export function useSuspendUser() {
-  return useBackendMutation(
-    (cell) => ({
-      method: "post",
-      url: "/api/admin/users/suspend",
-      params: { userId: cell.row.values.id },
-    }),
-    {},
-    // Stryker disable next-line all : hard to set up test for query key invalidation for mutations
-    "users",
-  );
-}
+export function useSuspendUser() {}
 
 export function useRestoreUser() {
killedBy: utils/users tests suspendUser tests suspendUser posts to correct endpoint on successful request
statusReason: Cannot read properties of undefined (reading 'mutate')

[Killed] ArrowFunction
src/main/utils/users.js:26:5
 
 export function useSuspendUser() {
   return useBackendMutation(
-    (cell) => ({
-      method: "post",
-      url: "/api/admin/users/suspend",
-      params: { userId: cell.row.values.id },
-    }),
+    () => undefined,
     {},
     // Stryker disable next-line all : hard to set up test for query key invalidation for mutations
killedBy: utils/users tests suspendUser tests suspendUser posts to correct endpoint on successful request
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ObjectLiteral
src/main/utils/users.js:26:16
 
 export function useSuspendUser() {
   return useBackendMutation(
-    (cell) => ({
-      method: "post",
-      url: "/api/admin/users/suspend",
-      params: { userId: cell.row.values.id },
-    }),
+    (cell) => ({}),
     {},
     // Stryker disable next-line all : hard to set up test for query key invalidation for mutations
killedBy: utils/users tests suspendUser tests suspendUser posts to correct endpoint on successful request
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
src/main/utils/users.js:27:15
 export function useSuspendUser() {
   return useBackendMutation(
     (cell) => ({
-      method: "post",
+      method: "",
       url: "/api/admin/users/suspend",
       params: { userId: cell.row.values.id },
killedBy: utils/users tests suspendUser tests suspendUser posts to correct endpoint on successful request
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/main/utils/users.js:37:34
   );
 }
 
-export function useRestoreUser() {
-  return useBackendMutation(
-    (cell) => ({
-      method: "post",
-      url: "/api/admin/users/restore",
-      params: { userId: cell.row.values.id },
-    }),
-    {},
-    // Stryker disable next-line all : hard to set up test for query key invalidation for mutations
-    "users",
-  );
-}
+export function useRestoreUser() {}
 
killedBy: utils/users tests restoreUser tests restoreUser posts to correct endpoint on success request
statusReason: Cannot read properties of undefined (reading 'mutate')

[Killed] ArrowFunction
src/main/utils/users.js:39:5
 
 export function useRestoreUser() {
   return useBackendMutation(
-    (cell) => ({
-      method: "post",
-      url: "/api/admin/users/restore",
-      params: { userId: cell.row.values.id },
-    }),
+    () => undefined,
     {},
     // Stryker disable next-line all : hard to set up test for query key invalidation for mutations
killedBy: utils/users tests restoreUser tests restoreUser posts to correct endpoint on success request
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
