[Killed] OptionalChaining
main/components/Chat/ChatMessageDisplay.jsx:5:20
 import { useCurrentUser } from "main/utils/currentUser";
 
 const ChatMessageDisplay = ({ message }) => {
-  const username = message?.username || "Anonymous";
+  const username = message.username || "Anonymous";
 
   const formattedTimestamp = message?.timestamp
killedBy: ChatMessageDisplay tests renders correct content with no message
statusReason: Cannot read properties of undefined (reading 'username')

[Killed] ConditionalExpression
main/components/Chat/ChatMessageDisplay.jsx:5:20
 import { useCurrentUser } from "main/utils/currentUser";
 
 const ChatMessageDisplay = ({ message }) => {
-  const username = message?.username || "Anonymous";
+  const username = true;
 
   const formattedTimestamp = message?.timestamp
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  George Washington
Received:

[Killed] OptionalChaining
main/components/Chat/ChatMessageDisplay.jsx:7:30
 const ChatMessageDisplay = ({ message }) => {
   const username = message?.username || "Anonymous";
 
-  const formattedTimestamp = message?.timestamp
+  const formattedTimestamp = message.timestamp
     ? message.timestamp.replace("T", " ").split(".")[0]
     : "";
killedBy: ChatMessageDisplay tests renders correct content with no message
statusReason: Cannot read properties of undefined (reading 'timestamp')

[Killed] OptionalChaining
main/components/Chat/ChatMessageDisplay.jsx:12:25
     : "";
 
   const { data: currentUser } = useCurrentUser();
-  const currentUserId = currentUser.root?.user.id;
+  const currentUserId = currentUser.root.user.id;
 
   const testId = `ChatMessageDisplay-${message?.id}`;
killedBy: ChatMessageDisplay tests renders correct content with username
statusReason: Cannot read properties of null (reading 'user')

[Killed] OptionalChaining
main/components/Chat/ChatMessageDisplay.jsx:14:40
   const { data: currentUser } = useCurrentUser();
   const currentUserId = currentUser.root?.user.id;
 
-  const testId = `ChatMessageDisplay-${message?.id}`;
+  const testId = `ChatMessageDisplay-${message.id}`;
 
   return (
killedBy: ChatMessageDisplay tests renders correct content with no message
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
main/components/Chat/ChatMessageDisplay.jsx:19:11
   return (
     <Card
       data-testid={testId}
-      bg={currentUserId === message?.userId ? "primary" : "secondary"}
+      bg={currentUserId !== message?.userId ? "primary" : "secondary"}
       text={"white"}
     >
killedBy: ChatMessageDisplay tests renders correct content with username
statusReason: expect(element).toHaveClass("card bg-secondary text-white")

Expected the element to have class:
  card bg-secondary text-white
Received:
  card bg-primary text-white

[Killed] ConditionalExpression
main/components/Chat/ChatMessageDisplay.jsx:19:11
   return (
     <Card
       data-testid={testId}
-      bg={currentUserId === message?.userId ? "primary" : "secondary"}
+      bg={false ? "primary" : "secondary"}
       text={"white"}
     >
killedBy: ChatMessageDisplay tests current user message
statusReason: expect(element).toHaveClass("card bg-primary text-white")

Expected the element to have class:
  card bg-primary text-white
Received:
  card bg-secondary text-white

[Killed] StringLiteral
main/components/Chat/ChatMessageDisplay.jsx:27:25
           style={{
             display: "flex",
             justifyContent: "space-between",
-            alignItems: "center",
+            alignItems: "",
           }}
         >
killedBy: ChatMessageDisplay tests renders correct content with username
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- align-items: center;
  display: flex;
  justify-content: space-between;

[Killed] ObjectLiteral
main/components/Chat/ChatMessageDisplay.jsx:30:61
             alignItems: "center",
           }}
         >
-          <Card.Title data-testid={`${testId}-User`} style={{ margin: 0 }}>
+          <Card.Title data-testid={`${testId}-User`} style={{}}>
             {username}
           </Card.Title>
killedBy: ChatMessageDisplay tests renders correct content with username
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- margin: 0px;

[Killed] ObjectLiteral
main/components/Chat/ChatMessageDisplay.jsx:33:64
           <Card.Title data-testid={`${testId}-User`} style={{ margin: 0 }}>
             {username}
           </Card.Title>
-          <Card.Subtitle data-testid={`${testId}-Date`} style={{ margin: 0 }}>
+          <Card.Subtitle data-testid={`${testId}-Date`} style={{}}>
             {formattedTimestamp}
           </Card.Subtitle>
killedBy: ChatMessageDisplay tests renders correct content with username
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- margin: 0px;

[Killed] OptionalChaining
main/components/Chat/ChatMessageDisplay.jsx:38:12
           </Card.Subtitle>
         </div>
         <Card.Text data-testid={`${testId}-Message`}>
-          {message?.message}
+          {message.message}
         </Card.Text>
       </Card.Body>
killedBy: ChatMessageDisplay tests renders correct content with no message
statusReason: Cannot read properties of undefined (reading 'message')
