[Killed] BlockStatement
main/components/Chat/ChatPanel.jsx:6:38
 import ChatMessageCreate from "main/components/Chat/ChatMessageCreate";
 import ChatDisplay from "main/components/Chat/ChatDisplay";
 
-const ChatPanel = ({ commonsId }) => {
-  return (
-    <Stack gap={2} style={{ backgroundColor: "white" }} data-testid="ChatPanel">
-      <ChatDisplay commonsId={commonsId} />
-      <ChatMessageCreate commonsId={commonsId} />
-    </Stack>
-  );
-};
+const ChatPanel = ({ commonsId }) => {};
 
 export default ChatPanel;
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Unable to find an element by: [data-testid="ChatPanel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"
