[Killed] BlockStatement
main/components/Commons/CommonsSelect.jsx:8:4
   handleCommonsSelection,
   selectedCommons,
   testid = "CommonsSelect",
-}) {
-  return (
-    <Form.Group className="mb-3">
-      <Form.Text htmlFor="commons" className="fw-bold fs-5">
-        Commons
-      </Form.Text>
-      <div className="ms-3" data-testid={`${testid}-CommonsSelect-div`}>
-        {commons.map((object) => (
-          <Form.Check
-            key={object.id}
-            type="radio"
-            label={object.name}
-            data-testid={`${testid}-commons-${object.id}`}
-            onChange={() => handleCommonsSelection(object.id, object.name)}
-            checked={selectedCommons === object.id}
-          />
-        ))}
-      </div>
-    </Form.Group>
-  );
-}
+}) {}
 
 export default CommonsSelect;
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Unable to find an element by: [data-testid="SetCowHealthForm-commons-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/Commons/CommonsSelect.jsx:15:22
         Commons
       </Form.Text>
       <div className="ms-3" data-testid={`${testid}-CommonsSelect-div`}>
-        {commons.map((object) => (
-          <Form.Check
-            key={object.id}
-            type="radio"
-            label={object.name}
-            data-testid={`${testid}-commons-${object.id}`}
-            onChange={() => handleCommonsSelection(object.id, object.name)}
-            checked={selectedCommons === object.id}
-          />
-        ))}
+        {commons.map(() => undefined)}
       </div>
     </Form.Group>
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Unable to find an element by: [data-testid="SetCowHealthForm-commons-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Commons/CommonsSelect.jsx:20:26
             key={object.id}
             type="radio"
             label={object.name}
-            data-testid={`${testid}-commons-${object.id}`}
+            data-testid={``}
             onChange={() => handleCommonsSelection(object.id, object.name)}
             checked={selectedCommons === object.id}
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Unable to find an element by: [data-testid="SetCowHealthForm-commons-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
