[Killed] BooleanLiteral
main/components/Commons/CommonsTable.jsx:17:46
 import { hasRole } from "main/utils/currentUser";
 
 export default function CommonsTable({ commons, currentUser }) {
-  const [showModal, setShowModal] = useState(false);
+  const [showModal, setShowModal] = useState(true);
   const [cellToDelete, setCellToDelete] = useState(null);
 
killedBy: Modal tests Clicking Delete button opens the modal for adminUser
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:23:52
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/admin/editcommons/${cell.row.values["commons.id"]}`);
+    navigate(`/admin/editcommons/${cell.row.values[""]}`);
   };
 
killedBy: AdminListCommonPage tests what happens when you click edit as an admin
statusReason: expected "spy" to be called with arguments: [ '/admin/editcommons/1' ]

Received: 

  1st spy call:

  [
-   "/admin/editcommons/1",

[Killed] BlockStatement
main/components/Commons/CommonsTable.jsx:32:42
     ["/api/commons/allplus"],
   );
 
-  const deleteCallback = async (cell) => {
-    setCellToDelete(cell);
-    setShowModal(true);
-  };
+  const deleteCallback = async (cell) => {};
 
   const confirmDelete = async (cell) => {
killedBy: Modal tests Clicking Delete button opens the modal for adminUser
statusReason: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Commons/CommonsTable.jsx:42:41
     setShowModal(false);
   };
 
-  const leaderboardCallback = (cell) => {
-    const route = `/leaderboard/${cell.row.values["commons.id"]}`;
-    navigate(route);
-  };
+  const leaderboardCallback = (cell) => {};
 
   const columns = [
killedBy: AdminListCommonPage tests what happens when you click leaderboard as an admin
statusReason: expected "spy" to be called with arguments: [ '/leaderboard/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:43:19
   };
 
   const leaderboardCallback = (cell) => {
-    const route = `/leaderboard/${cell.row.values["commons.id"]}`;
+    const route = ``;
     navigate(route);
   };
killedBy: AdminListCommonPage tests what happens when you click leaderboard as an admin
statusReason: expected "spy" to be called with arguments: [ '/leaderboard/1' ]

Received: 

  1st spy call:

  [
-   "/leaderboard/1",

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:54:17
     },
     {
       Header: "Name",
-      accessor: "commons.name",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="CommonsTable-cell-row-0-col-commons.name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ArrowFunction
main/components/Commons/CommonsTable.jsx:63:17
           <br /> Price
         </span>
       ),
-      accessor: (row) => row.commons.cowPrice,
+      accessor: () => undefined,
       id: "commons.cowPrice",
     },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.jsx:66:5
       accessor: (row) => row.commons.cowPrice,
       id: "commons.cowPrice",
     },
-    {
-      Header: (
-        <span>
-          Milk <br /> Price
-        </span>
-      ),
-      accessor: (row) => row.commons.milkPrice,
-      id: "commons.milkPrice",
-    },
+    {},
     {
       Header: (
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/CommonsTable.jsx:72:17
           Milk <br /> Price
         </span>
       ),
-      accessor: (row) => row.commons.milkPrice,
+      accessor: () => undefined,
       id: "commons.milkPrice",
     },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2
Received:

[Killed] ArrowFunction
main/components/Commons/CommonsTable.jsx:81:17
           Start <br /> Bal
         </span>
       ),
-      accessor: (row) => row.commons.startingBalance,
+      accessor: () => undefined,
       id: "commons.startingBalance",
     },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  10
Received:

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:82:11
         </span>
       ),
       accessor: (row) => row.commons.startingBalance,
-      id: "commons.startingBalance",
+      id: "",
     },
     {
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: A column ID (or string accessor) is required!

[Killed] MethodExpression
main/components/Commons/CommonsTable.jsx:90:26
           Starting <br /> Date
         </span>
       ),
-      accessor: (row) => String(row.commons.startingDate).slice(0, 10),
+      accessor: (row) => String(row.commons.startingDate),
       id: "commons.startingDate",
     },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2022-11-22$/
Received:
  2022-11-22T12:34:56

[Killed] ArrowFunction
main/components/Commons/CommonsTable.jsx:90:17
           Starting <br /> Date
         </span>
       ),
-      accessor: (row) => String(row.commons.startingDate).slice(0, 10),
+      accessor: () => undefined,
       id: "commons.startingDate",
     },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2022-11-22$/
Received:

[Killed] ArrowFunction
main/components/Commons/CommonsTable.jsx:99:17
           Last <br /> Date
         </span>
       ),
-      accessor: (row) => String(row.commons.lastDate).slice(0, 10),
+      accessor: () => undefined,
       id: "commons.lastDate",
     },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2022-11-22$/
Received:

[Killed] MethodExpression
main/components/Commons/CommonsTable.jsx:99:26
           Last <br /> Date
         </span>
       ),
-      accessor: (row) => String(row.commons.lastDate).slice(0, 10),
+      accessor: (row) => String(row.commons.lastDate),
       id: "commons.lastDate",
     },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2022-11-22$/
Received:
  2022-11-22T12:34:56

[Killed] ArrowFunction
main/components/Commons/CommonsTable.jsx:108:17
           Degrad <br /> Rate
         </span>
       ),
-      accessor: (row) => row.commons.degradationRate,
+      accessor: () => undefined,
       id: "commons.degradationRate",
     },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  0.01
Received:

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:117:11
           Show <br /> LrdrBrd?
         </span>
       ),
-      id: "commons.showLeaderboard", // needed for tests
+      id: "", // needed for tests
       accessor: (row, _rowIndex) => String(row.commons.showLeaderboard), // hack needed for boolean values to show up
     },
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.jsx:120:5
       id: "commons.showLeaderboard", // needed for tests
       accessor: (row, _rowIndex) => String(row.commons.showLeaderboard), // hack needed for boolean values to show up
     },
-    {
-      Header: (
-        <span>
-          Show <br /> Chat?
-        </span>
-      ),
-      id: "commons.showChat",
-      accessor: (row, _rowIndex) => String(row.commons.showChat),
-    },
+    {},
     {
       Header: (
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/CommonsTable.jsx:127:17
         </span>
       ),
       id: "commons.showChat",
-      accessor: (row, _rowIndex) => String(row.commons.showChat),
+      accessor: () => undefined,
     },
     {
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:

[Killed] ArrowFunction
main/components/Commons/CommonsTable.jsx:143:17
           Cap / <br /> User
         </span>
       ),
-      accessor: (row) => row.commons.capacityPerUser,
+      accessor: () => undefined,
       id: "commons.capacityPerUser",
     },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  5
Received:

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:144:11
         </span>
       ),
       accessor: (row) => row.commons.capacityPerUser,
-      id: "commons.capacityPerUser",
+      id: "",
     },
     {
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/CommonsTable.jsx:152:17
           Carry <br /> Cap
         </span>
       ),
-      accessor: (row) => row.commons.carryingCapacity,
+      accessor: () => undefined,
       id: "commons.carryingCapacity",
     },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  42
Received:

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.jsx:155:5
       accessor: (row) => row.commons.carryingCapacity,
       id: "commons.carryingCapacity",
     },
-    {
-      Header: (
-        <span>
-          Eff <br /> Cap
-        </span>
-      ),
-      accessor: "effectiveCapacity",
-    },
+    {},
   ];
 
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:173:7
     ButtonColumn("Delete", "danger", deleteCallback, testid),
     ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
     HrefButtonColumn(
-      "Stats CSV",
+      "",
       "success",
       `/api/commonstats/download?commonsId=`,
killedBy: UserTable tests renders without crashing for empty table for admin
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:174:7
     ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
     HrefButtonColumn(
       "Stats CSV",
-      "success",
+      "",
       `/api/commonstats/download?commonsId=`,
       testid,
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveClass("btn-success")

Expected the element to have class:
  btn-success
Received:
  btn

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:175:7
     HrefButtonColumn(
       "Stats CSV",
       "success",
-      `/api/commonstats/download?commonsId=`,
+      ``,
       testid,
     ),
killedBy: AdminListCommonPage tests correct href for stats csv button as an admin
statusReason: expect(element).toHaveAttribute("href", "/api/commonstats/download?commonsId=1") // element.getAttribute("href") === "/api/commonstats/download?commonsId=1"

Expected the element to have attribute:
  href="/api/commonstats/download?commonsId=1"
Received:
  href="1"

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:181:49
     HrefButtonColumn("Announcements", "info", `/admin/announcements/`, testid),
   ];
 
-  const columnsToDisplay = hasRole(currentUser, "ROLE_ADMIN")
+  const columnsToDisplay = hasRole(currentUser, "")
     ? columnsIfAdmin
     : columns;
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="CommonsTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ArrowFunction
main/components/Commons/CommonsTable.jsx:199:20
         <Button
           variant="secondary"
           data-testid="CommonsTable-Modal-Cancel"
-          onClick={() => setShowModal(false)}
+          onClick={() => undefined}
         >
           Keep this Commons
killedBy: Modal tests Clicking Keep this Commons button cancels the deletion
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
main/components/Commons/CommonsTable.jsx:199:39
         <Button
           variant="secondary"
           data-testid="CommonsTable-Modal-Cancel"
-          onClick={() => setShowModal(false)}
+          onClick={() => setShowModal(true)}
         >
           Keep this Commons
killedBy: Modal tests Clicking Keep this Commons button cancels the deletion
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/Commons/CommonsTable.jsx:206:20
         <Button
           variant="danger"
           data-testid="CommonsTable-Modal-Delete"
-          onClick={() => confirmDelete(cellToDelete)}
+          onClick={() => undefined}
         >
           Permanently Delete
killedBy: Modal tests Clicking Permanently Delete button deletes the commons
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/Commons/CommonsTable.jsx:217:8
   return (
     <>
       <OurTable data={commons} columns={columnsToDisplay} testid={testid} />
-      {hasRole(currentUser, "ROLE_ADMIN") && commonsModal}
+      {false}
     </>
   );
killedBy: Modal tests Clicking Delete button opens the modal for adminUser
statusReason: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


Ignored nodes: comments, script, style

[Killed] LogicalOperator
main/components/Commons/CommonsTable.jsx:217:8
   return (
     <>
       <OurTable data={commons} columns={columnsToDisplay} testid={testid} />
-      {hasRole(currentUser, "ROLE_ADMIN") && commonsModal}
+      {hasRole(currentUser, "ROLE_ADMIN") || commonsModal}
     </>
   );
killedBy: Modal tests Clicking Delete button opens the modal for adminUser
statusReason: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


Ignored nodes: comments, script, style
