[Killed] ConditionalExpression
main/components/Commons/HealthStrategiesUpdateDropdown.jsx:13:8
   return (
     <Form.Group className="mb-3">
       <Form.Label htmlFor={formName}>{displayName}</Form.Label>
-      {healthUpdateStrategies && (
-        <Form.Select
-          data-testid={`${formName}-select`}
-          id={formName}
-          // "required" option is not necessary, since dropdown will always have a value
-          {...register(formName)}
-          defaultValue={initialValue}
-        >
-          {healthUpdateStrategies.strategies.map((strategy) => (
-            <option
-              key={strategy.name}
-              value={strategy.name}
-              title={strategy.description}
-              data-testid={formName + "-" + strategy.name}
-            >
-              {strategy.displayName}
-            </option>
-          ))}
-        </Form.Select>
-      )}
+      {false}
     </Form.Group>
   );
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/Commons/HealthStrategiesUpdateDropdown.jsx:13:8
   return (
     <Form.Group className="mb-3">
       <Form.Label htmlFor={formName}>{displayName}</Form.Label>
-      {healthUpdateStrategies && (
-        <Form.Select
-          data-testid={`${formName}-select`}
-          id={formName}
-          // "required" option is not necessary, since dropdown will always have a value
-          {...register(formName)}
-          defaultValue={initialValue}
-        >
-          {healthUpdateStrategies.strategies.map((strategy) => (
-            <option
-              key={strategy.name}
-              value={strategy.name}
-              title={strategy.description}
-              data-testid={formName + "-" + strategy.name}
-            >
-              {strategy.displayName}
-            </option>
-          ))}
-        </Form.Select>
-      )}
+      {true}
     </Form.Group>
   );
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/Commons/HealthStrategiesUpdateDropdown.jsx:21:50
           {...register(formName)}
           defaultValue={initialValue}
         >
-          {healthUpdateStrategies.strategies.map((strategy) => (
-            <option
-              key={strategy.name}
-              value={strategy.name}
-              title={strategy.description}
-              data-testid={formName + "-" + strategy.name}
-            >
-              {strategy.displayName}
-            </option>
-          ))}
+          {healthUpdateStrategies.strategies.map(() => undefined)}
         </Form.Select>
       )}
killedBy: CommonsForm tests renders correctly when an initialCommons is passed in
statusReason: Unable to find an element by: [data-testid="aboveCapacityHealthUpdateStrategy-Noop"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
