[Killed] BlockStatement
main/components/Commons/ManageCowsModal.jsx:16:36
   onBuy,
   onSell,
 }) => {
-  const handleInputChange = (e) => {
-    if (e.target.value < 0) {
-      toast.warn(`Warning: You cannot ${message} a negative number of cows!`);
-    }
-    setNumber(e.target.value);
-  };
+  const handleInputChange = (e) => {};
 
   const handleSubmit = (e) => {
killedBy: ManageCowsModal toast warning for inputing negative number when buying cows
statusReason: expected "spy" to be called with arguments: [ '-3' ]

Number of calls: 0

[Killed] BlockStatement
main/components/Commons/ManageCowsModal.jsx:17:29
   onSell,
 }) => {
   const handleInputChange = (e) => {
-    if (e.target.value < 0) {
-      toast.warn(`Warning: You cannot ${message} a negative number of cows!`);
-    }
+    if (e.target.value < 0) {}
     setNumber(e.target.value);
   };
killedBy: ManageCowsModal toast warning for inputing negative number when buying cows
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/Commons/ManageCowsModal.jsx:17:9
   onSell,
 }) => {
   const handleInputChange = (e) => {
-    if (e.target.value < 0) {
+    if (false) {
       toast.warn(`Warning: You cannot ${message} a negative number of cows!`);
     }
killedBy: ManageCowsModal toast warning for inputing negative number when buying cows
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/components/Commons/ManageCowsModal.jsx:18:18
 }) => {
   const handleInputChange = (e) => {
     if (e.target.value < 0) {
-      toast.warn(`Warning: You cannot ${message} a negative number of cows!`);
+      toast.warn(``);
     }
     setNumber(e.target.value);
killedBy: ManageCowsModal toast warning for inputing negative number when buying cows
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Warning: You cannot buy a negative number of cows!",

[Killed] BlockStatement
main/components/Commons/ManageCowsModal.jsx:23:31
     setNumber(e.target.value);
   };
 
-  const handleSubmit = (e) => {
-    e.preventDefault();
-    if (number < 0) {
-      window.alert(
-        `You cannot ${message} a negative number of cows! Please enter a non-negative number.`,
-      );
-    } else {
-      if (message.includes("buy")) {
-        onBuy(userCommons, number);
-      } else {
-        onSell(userCommons, number);
-      }
-      setNumber(1);
-      onClose(); // Close the modal
-    }
-  };
+  const handleSubmit = (e) => {};
 
   const handleClose = () => {
killedBy: ManageCowsModal calls onBuy with correct arguments when buy button is clicked
statusReason: expected "spy" to be called with arguments: [ { userId: 1, …(8) }, 5 ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Commons/ManageCowsModal.jsx:25:21
 
   const handleSubmit = (e) => {
     e.preventDefault();
-    if (number < 0) {
-      window.alert(
-        `You cannot ${message} a negative number of cows! Please enter a non-negative number.`,
-      );
-    } else {
+    if (number < 0) {} else {
       if (message.includes("buy")) {
         onBuy(userCommons, number);
killedBy: ManageCowsModal windows toolkit warning for buying negative cows
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] EqualityOperator
main/components/Commons/ManageCowsModal.jsx:25:9
 
   const handleSubmit = (e) => {
     e.preventDefault();
-    if (number < 0) {
+    if (number <= 0) {
       window.alert(
         `You cannot ${message} a negative number of cows! Please enter a non-negative number.`,
killedBy: ManageCowsModal calls onSell with correct arguments when sell button is clicked (0 argument)
statusReason: expected "spy" to be called with arguments: [ { userId: 1, …(8) }, +0 ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Commons/ManageCowsModal.jsx:27:9
     e.preventDefault();
     if (number < 0) {
       window.alert(
-        `You cannot ${message} a negative number of cows! Please enter a non-negative number.`,
+        ``,
       );
     } else {
killedBy: ManageCowsModal windows toolkit warning for buying negative cows
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "You cannot buy a negative number of cows! Please enter a non-negative number.",

[Killed] BlockStatement
main/components/Commons/ManageCowsModal.jsx:29:12
       window.alert(
         `You cannot ${message} a negative number of cows! Please enter a non-negative number.`,
       );
-    } else {
-      if (message.includes("buy")) {
-        onBuy(userCommons, number);
-      } else {
-        onSell(userCommons, number);
-      }
-      setNumber(1);
-      onClose(); // Close the modal
-    }
+    } else {}
   };
 
killedBy: ManageCowsModal calls onBuy with correct arguments when buy button is clicked
statusReason: expected "spy" to be called with arguments: [ { userId: 1, …(8) }, 5 ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Commons/ManageCowsModal.jsx:30:36
         `You cannot ${message} a negative number of cows! Please enter a non-negative number.`,
       );
     } else {
-      if (message.includes("buy")) {
-        onBuy(userCommons, number);
-      } else {
+      if (message.includes("buy")) {} else {
         onSell(userCommons, number);
       }
killedBy: ManageCowsModal calls onBuy with correct arguments when buy button is clicked
statusReason: expected "spy" to be called with arguments: [ { userId: 1, …(8) }, 5 ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Commons/ManageCowsModal.jsx:30:11
         `You cannot ${message} a negative number of cows! Please enter a non-negative number.`,
       );
     } else {
-      if (message.includes("buy")) {
+      if (false) {
         onBuy(userCommons, number);
       } else {
killedBy: ManageCowsModal calls onBuy with correct arguments when buy button is clicked
statusReason: expected "spy" to be called with arguments: [ { userId: 1, …(8) }, 5 ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Commons/ManageCowsModal.jsx:32:14
     } else {
       if (message.includes("buy")) {
         onBuy(userCommons, number);
-      } else {
-        onSell(userCommons, number);
-      }
+      } else {}
       setNumber(1);
       onClose(); // Close the modal
killedBy: ManageCowsModal calls onSell with correct arguments when sell button is clicked
statusReason: expected "spy" to be called with arguments: [ { userId: 1, …(8) }, 3 ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Commons/ManageCowsModal.jsx:40:29
     }
   };
 
-  const handleClose = () => {
-    setNumber(1);
-    onClose();
-  };
+  const handleClose = () => {};
 
   if (!isOpen) {
killedBy: ManageCowsModal calls onClose and setNumber when close button is clicked
statusReason: expected "spy" to be called at least once

[Killed] ConditionalExpression
main/components/Commons/ManageCowsModal.jsx:45:7
     onClose();
   };
 
-  if (!isOpen) {
+  if (false) {
     return null;
   }
killedBy: PlayPage tests click buy button
statusReason: Unable to find an element by: [data-testid="buy-cow-button"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
main/components/Commons/ManageCowsModal.jsx:45:7
     onClose();
   };
 
-  if (!isOpen) {
+  if (isOpen) {
     return null;
   }
killedBy: ManageCowsModal renders the modal when isOpen is true
statusReason: Unable to find an element by: [data-testid="buy-sell-cow-modal"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
main/components/Commons/ManageCowsModal.jsx:51:20
 
   return (
     <Modal
-      data-testid={"buy-sell-cow-modal"}
+      data-testid={""}
       show={isOpen}
       onHide={handleClose}
killedBy: ManageCowsModal renders the modal when isOpen is true
statusReason: Unable to find an element by: [data-testid="buy-sell-cow-modal"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Commons/ManageCowsModal.jsx:58:26
       <Modal.Body>
         <Form onSubmit={handleSubmit}>
           <Form.Group
-            data-testid={"buy-sell-cow-modal-closeGroup"}
+            data-testid={""}
             style={{ display: "flex", justifyContent: "right" }}
           >
killedBy: ManageCowsModal Check styling of modal components
statusReason: Unable to find an element by: [data-testid="buy-sell-cow-modal-closeGroup"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 2048px;"
>

[Killed] StringLiteral
main/components/Commons/ManageCowsModal.jsx:59:31
         <Form onSubmit={handleSubmit}>
           <Form.Group
             data-testid={"buy-sell-cow-modal-closeGroup"}
-            style={{ display: "flex", justifyContent: "right" }}
+            style={{ display: "", justifyContent: "right" }}
           >
             <Button
killedBy: ManageCowsModal Check styling of modal components
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- display: flex;
+ display: block;
  justify-content: right;

[Killed] StringLiteral
main/components/Commons/ManageCowsModal.jsx:59:55
         <Form onSubmit={handleSubmit}>
           <Form.Group
             data-testid={"buy-sell-cow-modal-closeGroup"}
-            style={{ display: "flex", justifyContent: "right" }}
+            style={{ display: "flex", justifyContent: "" }}
           >
             <Button
killedBy: ManageCowsModal Check styling of modal components
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

  display: flex;
- justify-content: right;

[Killed] StringLiteral
main/components/Commons/ManageCowsModal.jsx:83:28
           </Form.Group>
           <Form.Group>
             <Form.Control
-              data-testid={"buy-sell-cow-modal-input"}
+              data-testid={""}
               style={{ width: "20%" }}
               type="number"
killedBy: ManageCowsModal toast warning for inputing negative number when buying cows
statusReason: Unable to find an element by: [data-testid="buy-sell-cow-modal-input"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 2048px;"
>

[Killed] ObjectLiteral
main/components/Commons/ManageCowsModal.jsx:84:22
           <Form.Group>
             <Form.Control
               data-testid={"buy-sell-cow-modal-input"}
-              style={{ width: "20%" }}
+              style={{}}
               type="number"
               value={number}
killedBy: ManageCowsModal Check styling of modal components
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- width: 20%;

[Killed] StringLiteral
main/components/Commons/ManageCowsModal.jsx:94:22
         </Form>
       </Modal.Body>
       <Modal.Footer
-        data-testid={"buy-sell-cow-modal-footer"}
+        data-testid={""}
         style={{ borderTop: "0px" }}
       >
killedBy: ManageCowsModal Check styling of modal components
statusReason: Unable to find an element by: [data-testid="buy-sell-cow-modal-footer"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 2048px;"
>

[Killed] StringLiteral
main/components/Commons/ManageCowsModal.jsx:98:24
         style={{ borderTop: "0px" }}
       >
         <Button
-          data-testid={"buy-sell-cow-modal-cancel"}
+          data-testid={""}
           variant="secondary"
           onClick={handleClose}
killedBy: ManageCowsModal calls onClose and setNumber when cancel button is clicked
statusReason: Unable to find an element by: [data-testid="buy-sell-cow-modal-cancel"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 2048px;"
>

[Killed] MethodExpression
main/components/Commons/ManageCowsModal.jsx:109:12
           variant="primary"
           onClick={handleSubmit}
         >
-          {message[0].toUpperCase() + message.slice(1)}
+          {message[0].toLowerCase() + message.slice(1)}
         </Button>
       </Modal.Footer>
killedBy: ManageCowsModal modal has correct buy capitalization
statusReason: Unable to find an element with the text: Buy. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 2048px;"
>

[Killed] MethodExpression
main/components/Commons/ManageCowsModal.jsx:109:39
           variant="primary"
           onClick={handleSubmit}
         >
-          {message[0].toUpperCase() + message.slice(1)}
+          {message[0].toUpperCase() + message}
         </Button>
       </Modal.Footer>
killedBy: ManageCowsModal modal has correct buy capitalization
statusReason: Unable to find an element with the text: Buy. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 2048px;"
>
