[Killed] BlockStatement
main/components/Jobs/InstructorReportForm.jsx:4:49
 import { Button, Form } from "react-bootstrap";
 import { useForm } from "react-hook-form";
 
-function InstructorReportForm({ submitAction }) {
-  const { handleSubmit } = useForm();
-
-  return (
-    <Form onSubmit={handleSubmit(submitAction)}>
-      <p>Click this button to generate an instructor report!</p>
-      <Button type="submit" data-testid="InstructorReport-Submit-Button">
-        Generate
-      </Button>
-    </Form>
-  );
-}
+function InstructorReportForm({ submitAction }) {}
 export default InstructorReportForm;
 
killedBy: AdminJobsPage tests user can submit instructor report job
statusReason: Unable to find an element by: [data-testid="InstructorReport-Submit-Button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
