[Killed] ArrayDeclaration
main/components/Jobs/InstructorReportSpecificCommonsForm.jsx:11:5
   const testid = "InstructorReportSpecificCommonsForm";
 
   const { data: commons } = useBackend(
-    ["/api/commons/all"],
+    [],
     { url: "/api/commons/all" },
     [],
killedBy: InstructorReportSpecificCommonsForm tests the correct parameters are passed to useBackend
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/commons/all' ], …(2) ]

Received: 

  1st useBackend call:

  [
-   [

[Killed] BlockStatement
main/components/Jobs/InstructorReportSpecificCommonsForm.jsx:24:48
     formState: { _errors },
   } = useForm();
 
-  const handleCommonsSelection = (id, name) => {
-    setSelectedCommons(id);
-    setSelectedCommonsName(name);
-  };
+  const handleCommonsSelection = (id, name) => {};
 
   const onSubmit = () => {
killedBy: InstructorReportSpecificCommonsForm tests user can sucessfully submit the job
statusReason: expected "spy" to be called with arguments: [ { selectedCommons: 1, …(1) } ]

Received: 

  1st spy call:

  [
    {

[Killed] BlockStatement
main/components/Jobs/InstructorReportSpecificCommonsForm.jsx:29:26
     setSelectedCommonsName(name);
   };
 
-  const onSubmit = () => {
-    const params = { selectedCommons, selectedCommonsName };
-    submitAction(params);
-  };
+  const onSubmit = () => {};
 
   if (!commons || commons.length === 0) {
killedBy: InstructorReportSpecificCommonsForm tests user can sucessfully submit the job
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] BlockStatement
main/components/Jobs/InstructorReportSpecificCommonsForm.jsx:34:41
     submitAction(params);
   };
 
-  if (!commons || commons.length === 0) {
-    return <div>There are no commons on which to run this job.</div>;
-  }
+  if (!commons || commons.length === 0) {}
 
   if (selectedCommons === null) {
killedBy: InstructorReportSpecificCommonsForm tests renders the fallback text correctlyl
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
main/components/Jobs/InstructorReportSpecificCommonsForm.jsx:34:19
     submitAction(params);
   };
 
-  if (!commons || commons.length === 0) {
+  if (!commons || commons.length !== 0) {
     return <div>There are no commons on which to run this job.</div>;
   }
killedBy: InstructorReportSpecificCommonsForm tests renders the fallback text correctlyl
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
main/components/Jobs/InstructorReportSpecificCommonsForm.jsx:38:33
     return <div>There are no commons on which to run this job.</div>;
   }
 
-  if (selectedCommons === null) {
-    setSelectedCommons(commons[0].id);
-    setSelectedCommonsName(commons[0].name);
-  }
+  if (selectedCommons === null) {}
 
   return (
killedBy: InstructorReportSpecificCommonsForm tests the first item in commons array is selected by default
statusReason: expect(element).toHaveAttribute("checked", "") // element.getAttribute("checked") === ""

Expected the element to have attribute:
  checked=""
Received:
  null

[Killed] ConditionalExpression
main/components/Jobs/InstructorReportSpecificCommonsForm.jsx:38:7
     return <div>There are no commons on which to run this job.</div>;
   }
 
-  if (selectedCommons === null) {
+  if (true) {
     setSelectedCommons(commons[0].id);
     setSelectedCommonsName(commons[0].name);
killedBy: InstructorReportSpecificCommonsForm tests user can sucessfully submit the job
statusReason: Unable to find an element by: [data-testid="InstructorReportSpecificCommonsForm-commons-1"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
