[Killed] StringLiteral
main/components/Jobs/MilkCowsJobForm.jsx:11:6
   // Stryker restore all
 
   const { data: commonsAll } = useBackend(
-    ["/api/commons/all"],
+    [""],
     { url: "/api/commons/all" },
     [],
killedBy: MilkTheCowsForm tests the correct parameters are passed to useBackend
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/commons/all' ], …(2) ]

Received: 

  1st useBackend call:

@@ -1,8 +1,8 @@
  [

[Killed] ObjectLiteral
main/components/Jobs/MilkCowsJobForm.jsx:16:26
     [],
   );
 
-  const allCommonsProp = { id: 0, name: "All Commons" };
+  const allCommonsProp = {};
 
   const commons = [allCommonsProp, ...commonsAll];
killedBy: MilkTheCowsForm tests the first item in commons array is selected by default
statusReason: Unable to find an element by: [data-testid="MilkTheCowsForm-commons-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Jobs/MilkCowsJobForm.jsx:36:7
   };
 
   // TODO: calculate the selected commons with regular variable instead of setting state in render
-  if (selectedCommons === null) {
+  if (false) {
     setSelectedCommons(commons[0].id);
     setSelectedCommonsName(commons[0].name);
killedBy: MilkTheCowsForm tests the first item in commons array is selected by default
statusReason: expect(element).toHaveAttribute("checked", "") // element.getAttribute("checked") === ""

Expected the element to have attribute:
  checked=""
Received:
  null

[Killed] EqualityOperator
main/components/Jobs/MilkCowsJobForm.jsx:36:7
   };
 
   // TODO: calculate the selected commons with regular variable instead of setting state in render
-  if (selectedCommons === null) {
+  if (selectedCommons !== null) {
     setSelectedCommons(commons[0].id);
     setSelectedCommonsName(commons[0].name);
killedBy: MilkTheCowsForm tests user can sucessfully submit the job
statusReason: Unable to find an element by: [data-testid="MilkTheCowsForm-Submit-Button"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
