[Killed] StringLiteral
main/components/Jobs/SetCowHealthForm.jsx:32:26
   const handleHealthValueChange = (e) => {
     const newValue = e.target.value;
     setHealthValue(newValue);
-    localStorage.setItem(`${testid}-health`, newValue);
+    localStorage.setItem(``, newValue);
   };
 
killedBy: SetCowHealthForm tests healthValue is saved in localstorage
statusReason: expected "setItem" to be called with arguments: [ 'SetCowHealthForm-health', '24' ]

Received: 

  1st setItem call:

  [
-   "SetCowHealthForm-health",

[Killed] BlockStatement
main/components/Jobs/SetCowHealthForm.jsx:40:26
     setSelectedCommonsName(name);
   };
 
-  const onSubmit = () => {
-    const params = { selectedCommons, healthValue, selectedCommonsName };
-    submitAction(params);
-  };
+  const onSubmit = () => {};
 
   if (!commons || commons.length === 0) {
killedBy: SetCowHealthForm tests user can sucessfully submit the job
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ConditionalExpression
main/components/Jobs/SetCowHealthForm.jsx:45:19
     submitAction(params);
   };
 
-  if (!commons || commons.length === 0) {
+  if (!commons || false) {
     return <div>There are no commons on which to run this job.</div>;
   }
killedBy: SetCowHealthForm tests renders the fallback text correctlyl
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/Jobs/SetCowHealthForm.jsx:49:7
     return <div>There are no commons on which to run this job.</div>;
   }
 
-  if (selectedCommons === null) {
+  if (false) {
     setSelectedCommons(commons[0].id);
     setSelectedCommonsName(commons[0].name);
killedBy: SetCowHealthForm tests the first item in commons array is selected by default
statusReason: expect(element).toHaveAttribute("checked", "") // element.getAttribute("checked") === ""

Expected the element to have attribute:
  checked=""
Received:
  null

[Killed] EqualityOperator
main/components/Jobs/SetCowHealthForm.jsx:49:7
     return <div>There are no commons on which to run this job.</div>;
   }
 
-  if (selectedCommons === null) {
+  if (selectedCommons !== null) {
     setSelectedCommons(commons[0].id);
     setSelectedCommonsName(commons[0].name);
killedBy: SetCowHealthForm tests user can sucessfully submit the job
statusReason: Unable to find an element by: [data-testid="SetCowHealthForm-healthValue"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ObjectLiteral
main/components/Jobs/SetCowHealthForm.jsx:77:39
           type="number"
           step="1"
           value={healthValue}
-          {...register("healthValue", {
-            required: "Health Value is required",
-            min: { value: 0, message: "Health Value must be ≥ 0" },
-            max: { value: 100, message: "Health Value must be ≤ 100" },
-          })}
+          {...register("healthValue", {})}
           onChange={handleHealthValueChange}
         />
killedBy: SetCowHealthForm tests validates health > 0
statusReason: Unable to find an element with the text: /Health Value must be ≥ 0/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
