[Killed] StringLiteral
main/components/Jobs/UpdateCowHealthForm.jsx:16:41
     [],
   );
 
-  const allCommonsProp = { id: 0, name: "All Commons" };
+  const allCommonsProp = { id: 0, name: "" };
 
   const commons = [allCommonsProp, ...commonsAll];
killedBy: AdminJobsPage tests user can submit update cow health job for all commons
statusReason: expected '/api/jobs/launch/updatecowhealthsingl…' to be '/api/jobs/launch/updatecowhealth' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
