[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.jsx:6:37
 
 // should take in a players list from a commons
 export default function LeaderboardTable({ leaderboardUsers }) {
-  const USD = new Intl.NumberFormat("en-US", {
+  const USD = new Intl.NumberFormat("", {
     style: "currency",
     currency: "USD",
killedBy: LeaderboardTable tests renders without crashing for empty table with user not logged in
statusReason: Incorrect locale information provided

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.jsx:12:5
   });
 
   const columns = [
-    {
-      Header: "Farmer",
-      accessor: (row, _rowIndex) => {
-        const url = `/admin/play/${row.commonsId}/user/${row.userId}`;
-        return <Link to={url}>{row.username}</Link>;
-      },
-    },
+    {},
     {
       Header: "Total Wealth",
killedBy: LeaderboardTable tests renders without crashing for empty table with user not logged in
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.jsx:21:17
     },
     {
       Header: "Total Wealth",
-      accessor: "totalWealth",
+      accessor: "",
       Cell: (props) => {
         return (
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="LeaderboardTable-cell-row-0-col-totalWealth"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.jsx:22:24
     {
       Header: "Total Wealth",
       accessor: "totalWealth",
-      Cell: (props) => {
-        return (
-          <div style={{ textAlign: "right" }}>{USD.format(props.value)}</div>
-        );
-      },
+      Cell: (props) => {},
     },
     {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  $1,000.00
Received:

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.jsx:24:36
       accessor: "totalWealth",
       Cell: (props) => {
         return (
-          <div style={{ textAlign: "right" }}>{USD.format(props.value)}</div>
+          <div style={{ textAlign: "" }}>{USD.format(props.value)}</div>
         );
       },
killedBy: LeaderboardTable tests Total wealth is formatted correctly
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- text-align: right;

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.jsx:24:23
       accessor: "totalWealth",
       Cell: (props) => {
         return (
-          <div style={{ textAlign: "right" }}>{USD.format(props.value)}</div>
+          <div style={{}}>{USD.format(props.value)}</div>
         );
       },
killedBy: LeaderboardTable tests Total wealth is formatted correctly
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- text-align: right;

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.jsx:35:5
         return <div style={{ textAlign: "right" }}>{props.value}</div>;
       },
     },
-    {
-      Header: "Cow Health",
-      accessor: "cowHealth",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
-    },
+    {},
     {
       Header: "Cows Bought",
killedBy: LeaderboardTable tests renders without crashing for empty table with user not logged in
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.jsx:50:15
       },
     },
     {
-      Header: "Cows Sold",
+      Header: "",
       accessor: "cowsSold",
       Cell: (props) => {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Unable to find an element with the text: Cows Sold. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.jsx:58:17
     },
     {
       Header: "Cow Deaths",
-      accessor: "cowDeaths",
+      accessor: "",
       Cell: (props) => {
         return <div style={{ textAlign: "right" }}>{props.value}</div>;
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="LeaderboardTable-cell-row-0-col-cowDeaths"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >
