[Killed] BlockStatement
main/components/Nav/Footer.jsx:3:34
 import { Container } from "react-bootstrap";
 
-export default function Footer() {
-  return (
-    <footer className="bg-light pt-3 pt-md-4 pb-4 pb-md-5">
-      <Container>
-        <p data-testid="footer-content">
-          HappyCows is a project of{" "}
-          <a href="https://devries.chem.ucsb.edu/about-5">Mattanjah de Vries</a>
-          , Distinguished Professor of Chemistry at UC Santa Barbara.
-        </p>
-      </Container>
-    </footer>
-  );
-}
+export default function Footer() {}
 
killedBy: Footer tests renders correctly
statusReason: Unable to find an element by: [data-testid="footer-content"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
