[Killed] StringLiteral
main/components/Profile/RoleBadge.jsx:7:31
 export default function RoleBadge({ role, currentUser }) {
   const roles = currentUser.root.roles.map((o) => o.authority);
 
-  const lcrole = role.replace("ROLE_", "").toLowerCase();
+  const lcrole = role.replace("", "").toLowerCase();
   return roles.includes(role) ? (
     <Badge className="bg-primary" data-testid={`role-badge-${lcrole}`}>
killedBy: ProfilePage tests renders correctly for admin user from UCSB
statusReason: Unable to find an element by: [data-testid="role-badge-user"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Profile/RoleBadge.jsx:13:24
       {lcrole}
     </Badge>
   ) : (
-    <span data-testid={`role-missing-${lcrole}`}></span>
+    <span data-testid={``}></span>
   );
 }
killedBy: RoleBadge tests renders without crashing for ROLE_ADMIN when user does NOT have ROLE_ADMIN
statusReason: Unable to find an element by: [data-testid="role-missing-admin"]

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      data-testid=""
    />
