[Killed] ObjectLiteral
main/components/Reports/ReportLineTable.jsx:7:5
 // should take in a players list from a commons
 export default function ReportLineTable({ reportLines }) {
   const columns = [
-    {
-      Header: "userId",
-      accessor: "userId",
-    },
+    {},
     {
       Header: "Username",
killedBy: AdminViewReportPage tests renders correctly for admin user
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reports/ReportLineTable.jsx:8:15
 export default function ReportLineTable({ reportLines }) {
   const columns = [
     {
-      Header: "userId",
+      Header: "",
       accessor: "userId",
     },
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: userId. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Reports/ReportLineTable.jsx:12:15
       accessor: "userId",
     },
     {
-      Header: "Username",
+      Header: "",
       accessor: "username",
     },
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: Username. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Reports/ReportLineTable.jsx:16:15
       accessor: "username",
     },
     {
-      Header: "Total Wealth",
+      Header: "",
       accessor: "totalWealth",
       Cell: (props) => {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: Total Wealth. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] BlockStatement
main/components/Reports/ReportLineTable.jsx:18:24
     {
       Header: "Total Wealth",
       accessor: "totalWealth",
-      Cell: (props) => {
-        return (
-          <div style={{ textAlign: "right" }}>
-            {formatter.format(props.value)}
-          </div>
-        );
-      },
+      Cell: (props) => {},
     },
     {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  $9,745.00
Received:

[Killed] ObjectLiteral
main/components/Reports/ReportLineTable.jsx:26:5
         );
       },
     },
-    {
-      Header: "Num Cows",
-      accessor: "numOfCows",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
-    },
+    {},
     {
       Header: "Avg Cow Health",
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reports/ReportLineTable.jsx:28:17
     },
     {
       Header: "Num Cows",
-      accessor: "numOfCows",
+      accessor: "",
       Cell: (props) => {
         return <div style={{ textAlign: "right" }}>{props.value}</div>;
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="ReportLineTable-cell-row-0-col-numOfCows"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Reports/ReportLineTable.jsx:35:17
     },
     {
       Header: "Avg Cow Health",
-      accessor: "avgCowHealth",
+      accessor: "",
       Cell: (props) => {
         return <div style={{ textAlign: "right" }}>{props.value}</div>;
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="ReportLineTable-cell-row-0-col-avgCowHealth"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] BlockStatement
main/components/Reports/ReportLineTable.jsx:36:24
     {
       Header: "Avg Cow Health",
       accessor: "avgCowHealth",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
+      Cell: (props) => {},
     },
     {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100
Received:

[Killed] BlockStatement
main/components/Reports/ReportLineTable.jsx:64:24
     {
       Header: "Create Date",
       accessor: "createDate",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
+      Cell: (props) => {},
     },
   ];
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2023-08-07T01:12:54.767+00:00
Received:

[Killed] StringLiteral
main/components/Reports/ReportLineTable.jsx:70:18
     },
   ];
 
-  const testid = "ReportLineTable";
+  const testid = "";
 
   return <OurTable data={reportLines} columns={columns} testid={testid} />;
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="ReportLineTable-cell-row-0-col-userId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >
