[Killed] BooleanLiteral
main/components/Reports/ReportTable.jsx:7:15
 // should take in a players list from a commons
 export default function ReportTable({
   reports,
-  storybook = false,
+  storybook = true,
   buttons = true,
 }) {
killedBy: ReportTable tests When not on storybook, navigates to view page
statusReason: expected "spy" to be called with arguments: [ '/admin/report/1' ]

Number of calls: 0

[Killed] BooleanLiteral
main/components/Reports/ReportTable.jsx:8:13
 export default function ReportTable({
   reports,
   storybook = false,
-  buttons = true,
+  buttons = false,
 }) {
   const testid = "ReportTable";
killedBy: ReportTable tests When not on storybook, navigates to view page
statusReason: Unable to find an element by: [data-testid="ReportTable-cell-row-0-col-View Report-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] BlockStatement
main/components/Reports/ReportTable.jsx:14:36
 
   const navigate = useNavigate();
 
-  const reportCallback = (cell) => {
-    const route = `/admin/report/${cell.row.values["id"]}`;
-    if (storybook) {
-      window.alert(`would navigate to ${route}`);
-    } else {
-      navigate(route);
-    }
-  };
+  const reportCallback = (cell) => {};
 
   const columns = [
killedBy: ReportTable tests When not on storybook, navigates to view page
statusReason: expected "spy" to be called with arguments: [ '/admin/report/1' ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/Reports/ReportTable.jsx:16:9
 
   const reportCallback = (cell) => {
     const route = `/admin/report/${cell.row.values["id"]}`;
-    if (storybook) {
+    if (true) {
       window.alert(`would navigate to ${route}`);
     } else {
killedBy: ReportTable tests When not on storybook, navigates to view page
statusReason: expected "spy" to be called with arguments: [ '/admin/report/1' ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/Reports/ReportTable.jsx:16:9
 
   const reportCallback = (cell) => {
     const route = `/admin/report/${cell.row.values["id"]}`;
-    if (storybook) {
+    if (false) {
       window.alert(`would navigate to ${route}`);
     } else {
killedBy: ReportTable tests When on storybook, calls window.alert
statusReason: expected "bound " to be called with arguments: [ 'would navigate to /admin/report/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Reports/ReportTable.jsx:18:12
     const route = `/admin/report/${cell.row.values["id"]}`;
     if (storybook) {
       window.alert(`would navigate to ${route}`);
-    } else {
-      navigate(route);
-    }
+    } else {}
   };
 
killedBy: ReportTable tests When not on storybook, navigates to view page
statusReason: expected "spy" to be called with arguments: [ '/admin/report/1' ]

Number of calls: 0

[Killed] ObjectLiteral
main/components/Reports/ReportTable.jsx:28:5
       Header: "id",
       accessor: "id",
     },
-    {
-      Header: "commonsId",
-      accessor: "commonsId",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
-    },
+    {},
     {
       Header: "Name",
killedBy: ReportTable tests Has the expected column headers and content
statusReason: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Reports/ReportTable.jsx:31:24
     {
       Header: "commonsId",
       accessor: "commonsId",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
+      Cell: (props) => {},
     },
     {
killedBy: ReportTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] StringLiteral
main/components/Reports/ReportTable.jsx:40:15
       accessor: "name",
     },
     {
-      Header: "Create Date",
+      Header: "",
       accessor: "createDate",
     },
killedBy: ReportTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: Create Date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Reports/ReportTable.jsx:41:17
     },
     {
       Header: "Create Date",
-      accessor: "createDate",
+      accessor: "",
     },
     {
killedBy: ReportTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="ReportTable-cell-row-0-col-createDate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Reports/ReportTable.jsx:45:17
     },
     {
       Header: "Num Users",
-      accessor: "numUsers",
+      accessor: "",
       Cell: (props) => {
         return <div style={{ textAlign: "right" }}>{props.value}</div>;
killedBy: ReportTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="ReportTable-cell-row-0-col-numUsers"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] BlockStatement
main/components/Reports/ReportTable.jsx:46:24
     {
       Header: "Num Users",
       accessor: "numUsers",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
+      Cell: (props) => {},
     },
     {
killedBy: ReportTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] StringLiteral
main/components/Reports/ReportTable.jsx:51:15
       },
     },
     {
-      Header: "Num Cows",
+      Header: "",
       accessor: "numCows",
       Cell: (props) => {
killedBy: ReportTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: Num Cows. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] BlockStatement
main/components/Reports/ReportTable.jsx:53:24
     {
       Header: "Num Cows",
       accessor: "numCows",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
+      Cell: (props) => {},
     },
   ];
killedBy: ReportTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  3
Received:

[Killed] BlockStatement
main/components/Reports/ReportTable.jsx:59:16
     },
   ];
 
-  if (buttons) {
-    columns.push(
-      ButtonColumn("View Report", "secondary", reportCallback, testid),
-    );
-  }
+  if (buttons) {}
   return <OurTable data={reports} columns={columns} testid={testid} />;
 }
killedBy: ReportTable tests When not on storybook, navigates to view page
statusReason: Unable to find an element by: [data-testid="ReportTable-cell-row-0-col-View Report-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Reports/ReportTable.jsx:61:35
 
   if (buttons) {
     columns.push(
-      ButtonColumn("View Report", "secondary", reportCallback, testid),
+      ButtonColumn("View Report", "", reportCallback, testid),
     );
   }
killedBy: ReportTable tests When not on storybook, navigates to view page
statusReason: expect(element).toHaveClass("btn-secondary")

Expected the element to have class:
  btn-secondary
Received:
  btn
