[Killed] UpdateOperator
src/main/components/UserProfileTable.jsx:49:41
   var result = "";
 
   if (commons !== undefined) {
-    for (var i = 0; i < commons.length; i++) {
+    for (var i = 0; i < commons.length; i--) {
       result += commons[i].name + ", ";
     }
killedBy: UserProfileTable tests renders a table with user info
statusReason: Cannot read properties of undefined (reading 'name')
