[Killed] BooleanLiteral
main/components/Users/UsersTable.jsx:10:60
 export default function UsersTable({ users }) {
   const { mutate: suspendUser } = useSuspendUser();
   const { mutate: restoreUser } = useRestoreUser();
-  const [showSuspendModal, setShowSuspendModal] = useState(false);
+  const [showSuspendModal, setShowSuspendModal] = useState(true);
   const [showRestoreModal, setShowRestoreModal] = useState(false);
   const [selectedCell, setSelectedCell] = useState(null);
killedBy: Modal tests Clicking Suspend button opens the modal for suspendUser
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
main/components/Users/UsersTable.jsx:11:60
   const { mutate: suspendUser } = useSuspendUser();
   const { mutate: restoreUser } = useRestoreUser();
   const [showSuspendModal, setShowSuspendModal] = useState(false);
-  const [showRestoreModal, setShowRestoreModal] = useState(false);
+  const [showRestoreModal, setShowRestoreModal] = useState(true);
   const [selectedCell, setSelectedCell] = useState(null);
 
killedBy: Modal tests Clicking Suspend button opens the modal for suspendUser
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:14:43
   const [showRestoreModal, setShowRestoreModal] = useState(false);
   const [selectedCell, setSelectedCell] = useState(null);
 
-  const suspendCallback = async (cell) => {
-    setSelectedCell(cell);
-    setShowSuspendModal(true);
-  };
+  const suspendCallback = async (cell) => {};
 
   const restoreCallback = async (cell) => {
killedBy: Modal tests Clicking Suspend button opens the modal for suspendUser
statusReason: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


Ignored nodes: comments, script, style

[Killed] BooleanLiteral
main/components/Users/UsersTable.jsx:16:25
 
   const suspendCallback = async (cell) => {
     setSelectedCell(cell);
-    setShowSuspendModal(true);
+    setShowSuspendModal(false);
   };
 
killedBy: Modal tests Clicking Suspend button opens the modal for suspendUser
statusReason: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:19:43
     setShowSuspendModal(true);
   };
 
-  const restoreCallback = async (cell) => {
-    setSelectedCell(cell);
-    setShowRestoreModal(true);
-  };
+  const restoreCallback = async (cell) => {};
 
   const confirmSuspend = async () => {
killedBy: Modal tests Clicking Restore button opens the modal for restoreUser
statusReason: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


Ignored nodes: comments, script, style

[Killed] BooleanLiteral
main/components/Users/UsersTable.jsx:21:25
 
   const restoreCallback = async (cell) => {
     setSelectedCell(cell);
-    setShowRestoreModal(true);
+    setShowRestoreModal(false);
   };
 
killedBy: Modal tests Clicking Restore button opens the modal for restoreUser
statusReason: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:24:38
     setShowRestoreModal(true);
   };
 
-  const confirmSuspend = async () => {
-    suspendUser(selectedCell);
-    setShowSuspendModal(false);
-  };
+  const confirmSuspend = async () => {};
 
   const confirmRestore = async () => {
killedBy: Modal tests Clicking confirm suspend button calls suspendUser
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
main/components/Users/UsersTable.jsx:26:25
 
   const confirmSuspend = async () => {
     suspendUser(selectedCell);
-    setShowSuspendModal(false);
+    setShowSuspendModal(true);
   };
 
killedBy: Modal tests Clicking confirm suspend button calls suspendUser
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:29:38
     setShowSuspendModal(false);
   };
 
-  const confirmRestore = async () => {
-    restoreUser(selectedCell);
-    setShowRestoreModal(false);
-  };
+  const confirmRestore = async () => {};
 
   const columns = [
killedBy: Modal tests Clicking confirm restore button calls restoreUser
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
main/components/Users/UsersTable.jsx:31:25
 
   const confirmRestore = async () => {
     restoreUser(selectedCell);
-    setShowRestoreModal(false);
+    setShowRestoreModal(true);
   };
 
killedBy: Modal tests Clicking confirm restore button calls restoreUser
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:43:5
       Header: "First Name",
       accessor: "givenName",
     },
-    {
-      Header: "Last Name",
-      accessor: "familyName",
-    },
+    {},
     {
       Header: "Email",
killedBy: UserTable tests renders without crashing for empty table
statusReason: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:54:17
     {
       Header: "Last Online",
       id: "lastOnline",
-      accessor: (row) => formatTime(row.lastOnline),
+      accessor: () => undefined,
     },
     {
killedBy: UserTable tests Has the expected colum headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  6/4/2023
Received:

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:61:5
       id: "admin",
       accessor: (row, _rowIndex) => String(row.admin), // hack needed for boolean values to show up
     },
-    {
-      Header: "Suspended",
-      id: "suspended",
-      accessor: (row, _rowIndex) => String(row.suspended), // hack needed for boolean values to show up
-    },
+    {},
     ButtonColumn("Suspend", "danger", suspendCallback, "UsersTable"),
     ButtonColumn("Restore", "primary", restoreCallback, "UsersTable"),
killedBy: UserTable tests renders without crashing for empty table
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:62:15
       accessor: (row, _rowIndex) => String(row.admin), // hack needed for boolean values to show up
     },
     {
-      Header: "Suspended",
+      Header: "",
       id: "suspended",
       accessor: (row, _rowIndex) => String(row.suspended), // hack needed for boolean values to show up
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Unable to find an element with the text: Suspended. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:63:11
     },
     {
       Header: "Suspended",
-      id: "suspended",
+      id: "",
       accessor: (row, _rowIndex) => String(row.suspended), // hack needed for boolean values to show up
     },
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-suspended"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:64:17
     {
       Header: "Suspended",
       id: "suspended",
-      accessor: (row, _rowIndex) => String(row.suspended), // hack needed for boolean values to show up
+      accessor: () => undefined, // hack needed for boolean values to show up
     },
     ButtonColumn("Suspend", "danger", suspendCallback, "UsersTable"),
killedBy: UserTable tests Has the expected colum headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:66:56
       id: "suspended",
       accessor: (row, _rowIndex) => String(row.suspended), // hack needed for boolean values to show up
     },
-    ButtonColumn("Suspend", "danger", suspendCallback, "UsersTable"),
+    ButtonColumn("Suspend", "danger", suspendCallback, ""),
     ButtonColumn("Restore", "primary", restoreCallback, "UsersTable"),
   ];
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-Suspend-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:67:29
       accessor: (row, _rowIndex) => String(row.suspended), // hack needed for boolean values to show up
     },
     ButtonColumn("Suspend", "danger", suspendCallback, "UsersTable"),
-    ButtonColumn("Restore", "primary", restoreCallback, "UsersTable"),
+    ButtonColumn("Restore", "", restoreCallback, "UsersTable"),
   ];
 
killedBy: UserTable tests Has the expected colum headers and content
statusReason: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] BooleanLiteral
main/components/Users/UsersTable.jsx:71:70
   ];
 
   const suspendModal = (
-    <Modal show={showSuspendModal} onHide={() => setShowSuspendModal(false)}>
+    <Modal show={showSuspendModal} onHide={() => setShowSuspendModal(true)}>
       <Modal.Header closeButton>
         <Modal.Title>Suspend User</Modal.Title>
killedBy: Modal tests Pressing the escape key on the suspended modal cancels the suspension
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:71:44
   ];
 
   const suspendModal = (
-    <Modal show={showSuspendModal} onHide={() => setShowSuspendModal(false)}>
+    <Modal show={showSuspendModal} onHide={() => undefined}>
       <Modal.Header closeButton>
         <Modal.Title>Suspend User</Modal.Title>
killedBy: Modal tests Pressing the escape key on the suspended modal cancels the suspension
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] OptionalChaining
main/components/Users/UsersTable.jsx:76:43
         <Modal.Title>Suspend User</Modal.Title>
       </Modal.Header>
       <Modal.Body>
-        Are you sure you want to suspend {selectedCell?.row.values.email}?
+        Are you sure you want to suspend {selectedCell.row.values.email}?
       </Modal.Body>
       <Modal.Footer>
killedBy: UserTable tests renders without crashing for empty table
statusReason: Cannot read properties of null (reading 'row')

[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:79:46
         Are you sure you want to suspend {selectedCell?.row.values.email}?
       </Modal.Body>
       <Modal.Footer>
-        <Button variant="secondary" onClick={() => setShowSuspendModal(false)}>
+        <Button variant="secondary" onClick={() => undefined}>
           Cancel
         </Button>
killedBy: Modal tests Pressing the cancel button on the suspended modal cancels the suspension
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
main/components/Users/UsersTable.jsx:79:72
         Are you sure you want to suspend {selectedCell?.row.values.email}?
       </Modal.Body>
       <Modal.Footer>
-        <Button variant="secondary" onClick={() => setShowSuspendModal(false)}>
+        <Button variant="secondary" onClick={() => setShowSuspendModal(true)}>
           Cancel
         </Button>
killedBy: Modal tests Pressing the cancel button on the suspended modal cancels the suspension
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:90:44
   );
 
   const restoreModal = (
-    <Modal show={showRestoreModal} onHide={() => setShowRestoreModal(false)}>
+    <Modal show={showRestoreModal} onHide={() => undefined}>
       <Modal.Header closeButton>
         <Modal.Title>Restore User</Modal.Title>
killedBy: Modal tests Pressing the escape key on the restored modal cancels the restoration
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
main/components/Users/UsersTable.jsx:90:70
   );
 
   const restoreModal = (
-    <Modal show={showRestoreModal} onHide={() => setShowRestoreModal(false)}>
+    <Modal show={showRestoreModal} onHide={() => setShowRestoreModal(true)}>
       <Modal.Header closeButton>
         <Modal.Title>Restore User</Modal.Title>
killedBy: Modal tests Pressing the escape key on the restored modal cancels the restoration
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] OptionalChaining
main/components/Users/UsersTable.jsx:95:43
         <Modal.Title>Restore User</Modal.Title>
       </Modal.Header>
       <Modal.Body>
-        Are you sure you want to restore {selectedCell?.row.values.email}?
+        Are you sure you want to restore {selectedCell.row.values.email}?
       </Modal.Body>
       <Modal.Footer>
killedBy: UserTable tests renders without crashing for empty table
statusReason: Cannot read properties of null (reading 'row')

[Killed] BooleanLiteral
main/components/Users/UsersTable.jsx:98:72
         Are you sure you want to restore {selectedCell?.row.values.email}?
       </Modal.Body>
       <Modal.Footer>
-        <Button variant="secondary" onClick={() => setShowRestoreModal(false)}>
+        <Button variant="secondary" onClick={() => setShowRestoreModal(true)}>
           Cancel
         </Button>
killedBy: Modal tests Pressing the cancel button on the suspended modal cancels the restoration
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:98:46
         Are you sure you want to restore {selectedCell?.row.values.email}?
       </Modal.Body>
       <Modal.Footer>
-        <Button variant="secondary" onClick={() => setShowRestoreModal(false)}>
+        <Button variant="secondary" onClick={() => undefined}>
           Cancel
         </Button>
killedBy: Modal tests Pressing the cancel button on the suspended modal cancels the restoration
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style
