[Killed] BlockStatement
main/components/Utils/HomePageBackground.jsx:7:50
 import BackgroundNight from "./../../../assets/HomePageBackground-night.jpg";
 
 // istanbul ignore next: trivial function to ignore from coverage due to how it is structured. Should be refactored in the future so that it can be tested.
-export default function getBackgroundImage(time) {
-  if (time >= 6 && time < 9) {
-    return BackgroundMorning;
-  } else if (time >= 9 && time < 18) {
-    return BackgroundDay;
-  } else if (time >= 18 && time < 21) {
-    return BackgroundEvening;
-  } else {
-    return BackgroundNight;
-  }
-}
+export default function getBackgroundImage(time) {}
 
killedBy: HomePageBackground tests expect correct morning background
statusReason: expected undefined to deeply equal '/src/assets/HomePageBackground-mornin…'

[Killed] EqualityOperator
main/components/Utils/HomePageBackground.jsx:8:7
 
 // istanbul ignore next: trivial function to ignore from coverage due to how it is structured. Should be refactored in the future so that it can be tested.
 export default function getBackgroundImage(time) {
-  if (time >= 6 && time < 9) {
+  if (time < 6 && time < 9) {
     return BackgroundMorning;
   } else if (time >= 9 && time < 18) {
killedBy: HomePageBackground tests expect correct morning background
statusReason: expected '/src/assets/HomePageBackground-night.…' to deeply equal '/src/assets/HomePageBackground-mornin…'

[Killed] EqualityOperator
main/components/Utils/HomePageBackground.jsx:8:7
 
 // istanbul ignore next: trivial function to ignore from coverage due to how it is structured. Should be refactored in the future so that it can be tested.
 export default function getBackgroundImage(time) {
-  if (time >= 6 && time < 9) {
+  if (time > 6 && time < 9) {
     return BackgroundMorning;
   } else if (time >= 9 && time < 18) {
killedBy: HomePageBackground tests expect correct morning background
statusReason: expected '/src/assets/HomePageBackground-night.…' to deeply equal '/src/assets/HomePageBackground-mornin…'

[Killed] EqualityOperator
main/components/Utils/HomePageBackground.jsx:10:14
 export default function getBackgroundImage(time) {
   if (time >= 6 && time < 9) {
     return BackgroundMorning;
-  } else if (time >= 9 && time < 18) {
+  } else if (time > 9 && time < 18) {
     return BackgroundDay;
   } else if (time >= 18 && time < 21) {
killedBy: HomePageBackground tests expect correct day background
statusReason: expected '/src/assets/HomePageBackground-night.…' to deeply equal '/src/assets/HomePageBackground-day.jpg'

[Killed] EqualityOperator
main/components/Utils/HomePageBackground.jsx:10:27
 export default function getBackgroundImage(time) {
   if (time >= 6 && time < 9) {
     return BackgroundMorning;
-  } else if (time >= 9 && time < 18) {
+  } else if (time >= 9 && time >= 18) {
     return BackgroundDay;
   } else if (time >= 18 && time < 21) {
killedBy: HomePageBackground tests expect correct day background
statusReason: expected '/src/assets/HomePageBackground-night.…' to deeply equal '/src/assets/HomePageBackground-day.jpg'

[Killed] ConditionalExpression
main/components/Utils/HomePageBackground.jsx:12:14
     return BackgroundMorning;
   } else if (time >= 9 && time < 18) {
     return BackgroundDay;
-  } else if (time >= 18 && time < 21) {
+  } else if (false) {
     return BackgroundEvening;
   } else {
killedBy: HomePageBackground tests expect correct evening background
statusReason: expected '/src/assets/HomePageBackground-night.…' to deeply equal '/src/assets/HomePageBackground-evenin…'

[Killed] ConditionalExpression
main/components/Utils/HomePageBackground.jsx:12:28
     return BackgroundMorning;
   } else if (time >= 9 && time < 18) {
     return BackgroundDay;
-  } else if (time >= 18 && time < 21) {
+  } else if (time >= 18 && true) {
     return BackgroundEvening;
   } else {
killedBy: HomePageBackground tests expect correct night background
statusReason: expected '/src/assets/HomePageBackground-evenin…' to deeply equal '/src/assets/HomePageBackground-night.…'

[Killed] BlockStatement
main/components/Utils/HomePageBackground.jsx:14:10
     return BackgroundDay;
   } else if (time >= 18 && time < 21) {
     return BackgroundEvening;
-  } else {
-    return BackgroundNight;
-  }
+  } else {}
 }
 
killedBy: HomePageBackground tests expect correct night background
statusReason: expected undefined to deeply equal '/src/assets/HomePageBackground-night.…'
