[Killed] BlockStatement
main/components/Utils/Plaintext.jsx:5:45
 
 // based in part on this SO answer: https://codereview.stackexchange.com/a/211511
 
-export default function Plaintext({ text }) {
-  if (text == null) {
-    return <pre data-testid="plaintext-empty"></pre>;
-  }
-  const textToRender =
-    typeof text === "string" ? text : JSON.stringify(text, null, 2);
-  const [firstLine, ...rest] = textToRender.split("\n");
-  return (
-    <pre data-testid="plaintext">
-      <span>{firstLine}</span>
-      {rest.map((line, i) => (
-        <Fragment key={i}>
-          <br />
-          <span>{line}</span>
-        </Fragment>
-      ))}
-    </pre>
-  );
-}
+export default function Plaintext({ text }) {}
 
killedBy: PagedJobsTable tests renders correct content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
Received:

[Killed] EqualityOperator
main/components/Utils/Plaintext.jsx:10:5
     return <pre data-testid="plaintext-empty"></pre>;
   }
   const textToRender =
-    typeof text === "string" ? text : JSON.stringify(text, null, 2);
+    typeof text !== "string" ? text : JSON.stringify(text, null, 2);
   const [firstLine, ...rest] = textToRender.split("\n");
   return (
killedBy: Plaintext tests renders the correct text
statusReason: Unable to find an element with the text: foo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <pre
      data-testid="plaintext"
    >

[Killed] ConditionalExpression
main/components/Utils/Plaintext.jsx:10:5
     return <pre data-testid="plaintext-empty"></pre>;
   }
   const textToRender =
-    typeof text === "string" ? text : JSON.stringify(text, null, 2);
+    true ? text : JSON.stringify(text, null, 2);
   const [firstLine, ...rest] = textToRender.split("\n");
   return (
killedBy: Plaintext tests works on non-text types
statusReason: textToRender.split is not a function or its return value is not iterable

[Killed] ArrowFunction
main/components/Utils/Plaintext.jsx:15:17
   return (
     <pre data-testid="plaintext">
       <span>{firstLine}</span>
-      {rest.map((line, i) => (
-        <Fragment key={i}>
-          <br />
-          <span>{line}</span>
-        </Fragment>
-      ))}
+      {rest.map(() => undefined)}
     </pre>
   );
killedBy: Plaintext tests renders the correct text
statusReason: Unable to find an element with the text: bar. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <pre
      data-testid="plaintext"
    >
