[Killed] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.jsx:4:56
 import React from "react";
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function AdminCreateAnnouncementsPage() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create Announcement</h1>
-        <h2>Not implemented yet; coming soon!</h2>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function AdminCreateAnnouncementsPage() {}
 
killedBy: AdminCreateAnnouncementsPage tests renders page without crashing
statusReason: Unable to find an element with the text: Create Announcement. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
