[Killed] BlockStatement
src/main/pages/AdminStudentsCreatePage.jsx:3:51
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function AdminStudentsCreatePage() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function AdminStudentsCreatePage() {}
 
killedBy: AdminStudentsCreatePage tests Renders expected content
statusReason: Unable to find an element with the text: Create page not yet implemented. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
