[Killed] BlockStatement
src/main/pages/AdminStudentsIndexPage.jsx:3:50
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function AdminStudentsIndexPage() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Index page not yet implemented</h1>
-        <p>
-          <a href="/admin/createstudents">Create</a>
-        </p>
-        <p>
-          <a href="/admin/editstudents/1">Edit</a>
-        </p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function AdminStudentsIndexPage() {}
 
killedBy: AdminStudentsIndexPage tests Renders expected content
statusReason: Unable to find an element with the text: Index page not yet implemented. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
