[Killed] BlockStatement
src/main/pages/AdminUsersPage.jsx:6:30
 import UsersTable from "main/components/Users/UsersTable";
 
 import { useUsers } from "main/utils/users";
-const AdminUsersPage = () => {
-  const { data: users } = useUsers();
-
-  return (
-    <BasicLayout>
-      <h2>Users</h2>
-      <UsersTable users={users} />
-    </BasicLayout>
-  );
-};
+const AdminUsersPage = () => {};
 
 export default AdminUsersPage;
killedBy: AdminUsersPage tests renders without crashing on two users
statusReason: Unable to find an element with the text: Users. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
