[Killed] BlockStatement
src/main/pages/LoadingPage.jsx:3:36
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function HomePage() {
-  return (
-    <div data-testid={"LoadingPage-main-div"}>
-      <BasicLayout></BasicLayout>
-    </div>
-  );
-}
+export default function HomePage() {}
 
killedBy: LoadingPage tests renders without crashing when lists return empty list
statusReason: Unable to find an element by: [data-testid="LoadingPage-main-div"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
src/main/pages/LoadingPage.jsx:5:23
 
 export default function HomePage() {
   return (
-    <div data-testid={"LoadingPage-main-div"}>
+    <div data-testid={""}>
       <BasicLayout></BasicLayout>
     </div>
killedBy: LoadingPage tests renders without crashing when lists return empty list
statusReason: Unable to find an element by: [data-testid="LoadingPage-main-div"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid=""
    >
