[Killed] BlockStatement
src/main/pages/NotFoundPage.jsx:4:40
 import React from "react";
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function NotFoundPage() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>404 Error!</h1>
-        The Page You Are Looking For Does Not Exist Or You Do Not Have Access!
-      </div>
-    </BasicLayout>
-  );
-}
+export default function NotFoundPage() {}
 
killedBy: NotFoundPage tests renders correctly without crashing
statusReason: Unable to find an element with the text: 404 Error!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
