[Killed] BlockStatement
src/main/utils/announcementUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/announcements",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: AnnouncementUtils cellToAxiosParamsDelete It returns the correct params
statusReason: expected undefined to deeply equal { url: '/api/announcements', …(2) }

[Killed] ObjectLiteral
src/main/utils/announcementUtils.js:9:10
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/announcements",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
+  return {};
 }
 
killedBy: AnnouncementUtils cellToAxiosParamsDelete It returns the correct params
statusReason: expected {} to deeply equal { url: '/api/announcements', …(2) }

[Killed] StringLiteral
src/main/utils/announcementUtils.js:11:13
 export function cellToAxiosParamsDelete(cell) {
   return {
     url: "/api/announcements",
-    method: "DELETE",
+    method: "",
     params: {
       id: cell.row.values.id,
killedBy: AnnouncementUtils cellToAxiosParamsDelete It returns the correct params
statusReason: expected { url: '/api/announcements', …(2) } to deeply equal { url: '/api/announcements', …(2) }
