[Killed] BlockStatement
src/main/utils/commonsUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/commons",
-    method: "DELETE",
-    params: {
-      id: cell.row.values["commons.id"],
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 export function commonsNotJoined(commons, commonsJoined) {
killedBy: AdminListCommonPage tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ 'Commons with id 1 was deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
src/main/utils/commonsUtils.js:9:10
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/commons",
-    method: "DELETE",
-    params: {
-      id: cell.row.values["commons.id"],
-    },
-  };
+  return {};
 }
 
killedBy: AdminListCommonPage tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ 'Commons with id 1 was deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
src/main/utils/commonsUtils.js:12:13
   return {
     url: "/api/commons",
     method: "DELETE",
-    params: {
-      id: cell.row.values["commons.id"],
-    },
+    params: {},
   };
 }
killedBy: AdminListCommonPage tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ 'Commons with id 1 was deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/main/utils/commonsUtils.js:18:58
   };
 }
 
-export function commonsNotJoined(commons, commonsJoined) {
-  const joinedIdList = commonsJoined.map((c) => c.id);
-  return commons.filter((f) => !joinedIdList.includes(f.id));
-}
+export function commonsNotJoined(commons, commonsJoined) {}
 
killedBy: HomePage tests renders without crashing when lists return empty list
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/main/utils/commonsUtils.js:19:42
 }
 
 export function commonsNotJoined(commons, commonsJoined) {
-  const joinedIdList = commonsJoined.map((c) => c.id);
+  const joinedIdList = commonsJoined.map(() => undefined);
   return commons.filter((f) => !joinedIdList.includes(f.id));
 }
killedBy: CommonsUtils commonsNotJoined it computes the correct result
statusReason: expected [ { id: 10, …(12) }, …(6) ] to deeply equal [ { id: 8, …(12) }, …(3) ]

[Killed] ArrowFunction
src/main/utils/commonsUtils.js:20:25
 
 export function commonsNotJoined(commons, commonsJoined) {
   const joinedIdList = commonsJoined.map((c) => c.id);
-  return commons.filter((f) => !joinedIdList.includes(f.id));
+  return commons.filter(() => undefined);
 }
 
killedBy: HomePage tests Calls the callback when you click join
statusReason: Unable to find an element by: [data-testid="commonsCard-button-Join-4"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="HomePage-main-div"
      style="background-size: cover; background-image: url(/src/assets/HomePageBackground-day.jpg);"

[Killed] BooleanLiteral
src/main/utils/commonsUtils.js:20:32
 
 export function commonsNotJoined(commons, commonsJoined) {
   const joinedIdList = commonsJoined.map((c) => c.id);
-  return commons.filter((f) => !joinedIdList.includes(f.id));
+  return commons.filter((f) => joinedIdList.includes(f.id));
 }
 
killedBy: HomePage tests Calls the callback when you click join
statusReason: Unable to find an element by: [data-testid="commonsCard-button-Join-4"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="HomePage-main-div"
      style="background-size: cover; background-image: url(/src/assets/HomePageBackground-day.jpg);"
