[Killed] BlockStatement
src/main/utils/currentUser.js:5:34
 import axios from "axios";
 import { useNavigate } from "react-router";
 
-export function useCurrentUser() {
-  let rolesList = ["ERROR_GETTING_ROLES"];
-  return useQuery(
-    "/api/currentUser",
-    async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        try {
-          rolesList = response.data.roles.map((r) => r.authority);
-        } catch (e) {
-          console.error("Error getting roles: ", e);
-        }
-        response.data = { ...response.data, rolesList: rolesList };
-        return { loggedIn: true, root: response.data };
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return { loggedIn: false, root: null };
-      }
-    },
-    {
-      initialData: { loggedIn: false, root: null, initialData: true },
-    },
-  );
-}
+export function useCurrentUser() {}
 
 export function useLogout() {
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: Cannot destructure property 'data' of '(0 , useCurrentUser)(...)' as it is undefined.

[Killed] StringLiteral
src/main/utils/currentUser.js:35:36
   const navigate = useNavigate();
   const mutation = useMutation(async () => {
     await axios.post("/logout");
-    await queryClient.resetQueries("/api/currentUser", { exact: true });
+    await queryClient.resetQueries("", { exact: true });
     navigate("/");
   });
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: expected "resetQueries" to be called with arguments: [ '/api/currentUser', { exact: true } ]

Received: 

  1st resetQueries call:

  [
-   "/api/currentUser",

[Killed] StringLiteral
src/main/utils/currentUser.js:36:14
   const mutation = useMutation(async () => {
     await axios.post("/logout");
     await queryClient.resetQueries("/api/currentUser", { exact: true });
-    navigate("/");
+    navigate("");
   });
   return mutation;
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: expected "spy" to be called with arguments: [ '/' ]

Received: 

  1st spy call:

  [
-   "/",

[Killed] LogicalOperator
src/main/utils/currentUser.js:43:5
 
 export function hasRole(currentUser, role) {
   return (
-    currentUser &&
-    currentUser.loggedIn &&
-    currentUser.root &&
+    currentUser && currentUser.loggedIn || currentUser.root &&
     currentUser.root.rolesList &&
     currentUser.root.rolesList.includes(role)
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") return falsy when currentUser ill-defined
statusReason: Cannot read properties of null (reading 'root')
