[Killed] BlockStatement
src/main/utils/dateUtils.js:16:38
   );
 };
 
-const daysSinceTimestamp = (date) => {
-  var today = new Date();
-  var startingDate = new Date(date);
-  var timeDiff = Math.abs(today.getTime() - startingDate.getTime());
-  return Math.ceil(timeDiff / (1000 * 3600 * 24));
-};
+const daysSinceTimestamp = (date) => {};
 
 const minutesInSeconds = 60;
killedBy: dateUtils tests daysSinceTimestamp tests calculates days properly
statusReason: expected undefined to be 9 // Object.is equality
