[Killed] BlockStatement
src/main/utils/leaderboardSortingUtils.js:4:3
 export function sortByWealth(
   userCommonsArray,
   returnArraySize = userCommonsArray.length,
-) {
-  return userCommonsArray
-    .sort((a, b) => {
-      return b.totalWealth - a.totalWealth;
-    })
-    .slice(0, returnArraySize);
-}
+) {}
 
 export function sortByNumCows(
killedBy: leaderboardSortingUtils tests sortByWealth
statusReason: Cannot read properties of undefined (reading '0')

[Killed] MethodExpression
src/main/utils/leaderboardSortingUtils.js:5:10
   userCommonsArray,
   returnArraySize = userCommonsArray.length,
 ) {
-  return userCommonsArray
-    .sort((a, b) => {
-      return b.totalWealth - a.totalWealth;
-    })
+  return userCommonsArray
     .slice(0, returnArraySize);
 }
killedBy: leaderboardSortingUtils tests sortByWealth
statusReason: expected 1000 to be 100000 // Object.is equality

[Killed] MethodExpression
src/main/utils/leaderboardSortingUtils.js:5:10
   userCommonsArray,
   returnArraySize = userCommonsArray.length,
 ) {
-  return userCommonsArray
-    .sort((a, b) => {
-      return b.totalWealth - a.totalWealth;
-    })
-    .slice(0, returnArraySize);
+  return userCommonsArray.sort((a, b) => {
+  return b.totalWealth - a.totalWealth;
+});
 }
 
killedBy: leaderboardSortingUtils tests sortByWealthReturnOne
statusReason: expected 10 to be 1 // Object.is equality

[Killed] BlockStatement
src/main/utils/leaderboardSortingUtils.js:6:21
   returnArraySize = userCommonsArray.length,
 ) {
   return userCommonsArray
-    .sort((a, b) => {
-      return b.totalWealth - a.totalWealth;
-    })
+    .sort((a, b) => {})
     .slice(0, returnArraySize);
 }
killedBy: leaderboardSortingUtils tests sortByWealth
statusReason: expected 1000 to be 100000 // Object.is equality

[Killed] ArithmeticOperator
src/main/utils/leaderboardSortingUtils.js:7:14
 ) {
   return userCommonsArray
     .sort((a, b) => {
-      return b.totalWealth - a.totalWealth;
+      return b.totalWealth + a.totalWealth;
     })
     .slice(0, returnArraySize);
killedBy: leaderboardSortingUtils tests sortByWealth
statusReason: expected 1000 to be 100000 // Object.is equality

[Killed] BlockStatement
src/main/utils/leaderboardSortingUtils.js:15:3
 export function sortByNumCows(
   userCommonsArray,
   returnArraySize = userCommonsArray.length,
-) {
-  return userCommonsArray
-    .sort((a, b) => {
-      return b.numOfCows - a.numOfCows;
-    })
-    .slice(0, returnArraySize);
-}
+) {}
 
 export function sortByCowHealth(
killedBy: leaderboardSortingUtils tests sortByNumCows
statusReason: Cannot read properties of undefined (reading '0')

[Killed] MethodExpression
src/main/utils/leaderboardSortingUtils.js:16:10
   userCommonsArray,
   returnArraySize = userCommonsArray.length,
 ) {
-  return userCommonsArray
-    .sort((a, b) => {
-      return b.numOfCows - a.numOfCows;
-    })
-    .slice(0, returnArraySize);
+  return userCommonsArray.sort((a, b) => {
+  return b.numOfCows - a.numOfCows;
+});
 }
 
killedBy: leaderboardSortingUtils tests sortByNumCowsReturnOne
statusReason: expected 10 to be 1 // Object.is equality

[Killed] MethodExpression
src/main/utils/leaderboardSortingUtils.js:16:10
   userCommonsArray,
   returnArraySize = userCommonsArray.length,
 ) {
-  return userCommonsArray
-    .sort((a, b) => {
-      return b.numOfCows - a.numOfCows;
-    })
+  return userCommonsArray
     .slice(0, returnArraySize);
 }
killedBy: leaderboardSortingUtils tests sortByNumCows
statusReason: expected 8 to be 1000 // Object.is equality

[Killed] BlockStatement
src/main/utils/leaderboardSortingUtils.js:17:21
   returnArraySize = userCommonsArray.length,
 ) {
   return userCommonsArray
-    .sort((a, b) => {
-      return b.numOfCows - a.numOfCows;
-    })
+    .sort((a, b) => {})
     .slice(0, returnArraySize);
 }
killedBy: leaderboardSortingUtils tests sortByNumCows
statusReason: expected 8 to be 1000 // Object.is equality

[Killed] ArithmeticOperator
src/main/utils/leaderboardSortingUtils.js:18:14
 ) {
   return userCommonsArray
     .sort((a, b) => {
-      return b.numOfCows - a.numOfCows;
+      return b.numOfCows + a.numOfCows;
     })
     .slice(0, returnArraySize);
killedBy: leaderboardSortingUtils tests sortByNumCows
statusReason: expected 8 to be 1000 // Object.is equality

[Killed] BlockStatement
src/main/utils/leaderboardSortingUtils.js:26:3
 export function sortByCowHealth(
   userCommonsArray,
   returnArraySize = userCommonsArray.length,
-) {
-  //sorts in decreasing order, so the comparison function returns a negative when the first parameter is larger
-  return userCommonsArray
-    .sort((a, b) => {
-      return b.cowHealth - a.cowHealth;
-    })
-    .slice(0, returnArraySize);
-}
+) {}
 
killedBy: leaderboardSortingUtils tests sortByCowHealth
statusReason: Cannot read properties of undefined (reading '0')

[Killed] MethodExpression
src/main/utils/leaderboardSortingUtils.js:28:10
   returnArraySize = userCommonsArray.length,
 ) {
   //sorts in decreasing order, so the comparison function returns a negative when the first parameter is larger
-  return userCommonsArray
-    .sort((a, b) => {
-      return b.cowHealth - a.cowHealth;
-    })
-    .slice(0, returnArraySize);
+  return userCommonsArray.sort((a, b) => {
+  return b.cowHealth - a.cowHealth;
+});
 }
 
killedBy: leaderboardSortingUtils tests sortByCowHealthReturnOne
statusReason: expected 10 to be 1 // Object.is equality

[Killed] MethodExpression
src/main/utils/leaderboardSortingUtils.js:28:10
   returnArraySize = userCommonsArray.length,
 ) {
   //sorts in decreasing order, so the comparison function returns a negative when the first parameter is larger
-  return userCommonsArray
-    .sort((a, b) => {
-      return b.cowHealth - a.cowHealth;
-    })
+  return userCommonsArray
     .slice(0, returnArraySize);
 }
killedBy: leaderboardSortingUtils tests sortByCowHealth
statusReason: expected 93 to be 98 // Object.is equality

[Killed] BlockStatement
src/main/utils/leaderboardSortingUtils.js:29:21
 ) {
   //sorts in decreasing order, so the comparison function returns a negative when the first parameter is larger
   return userCommonsArray
-    .sort((a, b) => {
-      return b.cowHealth - a.cowHealth;
-    })
+    .sort((a, b) => {})
     .slice(0, returnArraySize);
 }
killedBy: leaderboardSortingUtils tests sortByCowHealth
statusReason: expected 93 to be 98 // Object.is equality

[Killed] ArithmeticOperator
src/main/utils/leaderboardSortingUtils.js:30:14
   //sorts in decreasing order, so the comparison function returns a negative when the first parameter is larger
   return userCommonsArray
     .sort((a, b) => {
-      return b.cowHealth - a.cowHealth;
+      return b.cowHealth + a.cowHealth;
     })
     .slice(0, returnArraySize);
killedBy: leaderboardSortingUtils tests sortByCowHealth
statusReason: expected 93 to be 98 // Object.is equality
