[Timeout] StringLiteral
main/components/Reports/ReportFormatterUtil.jsx:1:48
-export const formatter = new Intl.NumberFormat("en-US", {
+export const formatter = new Intl.NumberFormat("", {
   style: "currency",
   currency: "USD",
